{
  "title": "7th Grade English Vocabulary Dictionary",
  "weeks_definitions": [
    {
      "week_id": 1,
      "words_data": [
        {"word": "absence", "definition": "The state of being away or not present."},
        {"word": "abundant", "definition": "Existing or available in large quantities; plentiful."},
        {"word": "accessible", "definition": "Able to be reached or entered easily."},
        {"word": "accommodate", "definition": "To provide space or lodging for someone; to fit someone's needs."},
        {"word": "accompany", "definition": "To go somewhere with someone as a companion."},
        {"word": "achieve", "definition": "To successfully reach a goal through effort and skill."},
        {"word": "acquire", "definition": "To buy or obtain something for oneself."},
        {"word": "adaptation", "definition": "A change or process by which an organism or species becomes better suited to its environment."},
        {"word": "adequate", "definition": "Satisfactory or acceptable in quality or quantity."},
        {"word": "adjacent", "definition": "Next to or adjoining something else."},
        {"word": "adjust", "definition": "To alter or move something slightly to achieve a desired fit or appearance."},
        {"word": "administration", "definition": "The process or activity of running a business or organization."},
        {"word": "adolescent", "definition": "A young person who is developing from a child into an adult."},
        {"word": "advantage", "definition": "A condition or circumstance that puts one in a favorable or superior position."},
        {"word": "advice", "definition": "An opinion or recommendation offered as a guide to action."},
        {"word": "advise", "definition": "To offer suggestions about the best course of action to someone."},
        {"word": "aerial", "definition": "Existing, happening, or operating in the air."},
        {"word": "affection", "definition": "A gentle feeling of fondness or liking."},
        {"word": "aggressive", "definition": "Ready or likely to attack or confront; pursuing one's aims forcefully."},
        {"word": "ailment", "definition": "A physical disorder or illness, typically a minor one."},
        {"word": "alcohol", "definition": "A colorless volatile flammable liquid which is the intoxicating constituent of wine, beer, and spirits."},
        {"word": "algebra", "definition": "A branch of mathematics that uses letters and symbols to represent numbers in formulas and equations."},
        {"word": "allege", "definition": "To claim or assert that someone has done something illegal or wrong, typically without proof."},
        {"word": "allergy", "definition": "A damaging immune response by the body to a substance to which it has become hypersensitive."},
        {"word": "alliance", "definition": "A union or association formed for mutual benefit, especially between countries."},
        {"word": "allocate", "definition": "To distribute resources or duties for a particular purpose."},
        {"word": "alternative", "definition": "One of two or more available possibilities."},
        {"word": "amateur", "definition": "A person who engages in a pursuit on an unpaid rather than a professional basis."},
        {"word": "ambiguous", "definition": "Open to more than one interpretation; having a double meaning."},
        {"word": "ambition", "definition": "A strong desire to do or to achieve something, typically requiring determination and hard work."},
        {"word": "analogy", "definition": "A comparison between two things, typically for the purpose of explanation or clarification."},
        {"word": "analyze", "definition": "To examine methodically and in detail the constitution or structure of something."},
        {"word": "ancestor", "definition": "A person from whom one is descended; usually more remote than a grandparent."},
        {"word": "anecdote", "definition": "A short and amusing or interesting story about a real incident or person."},
        {"word": "anniversary", "definition": "The date on which an event occurred in a previous year."},
        {"word": "anonymous", "definition": "A person not identified by name; of unknown authorship."},
        {"word": "anthem", "definition": "A rousing or uplifting song identified with a particular group, body, or cause."},
        {"word": "anticipate", "definition": "To regard as probable; to expect or predict."},
        {"word": "antidote", "definition": "A medicine taken or given to counteract a particular poison."},
        {"word": "anxiety", "definition": "A feeling of worry, nervousness, or unease, typically about an imminent event or something with an uncertain outcome."}
      ]
    },
    {
      "week_id": 2,
      "words_data": [
        {"word": "apparatus", "definition": "The technical equipment or machinery needed for a particular activity or purpose."},
        {"word": "apparent", "definition": "Clearly visible or understood; obvious."},
        {"word": "appeal", "definition": "To make a serious or urgent request, typically to the public."},
        {"word": "appetite", "definition": "A natural desire to satisfy a bodily need, especially for food."},
        {"word": "appliance", "definition": "A device or piece of equipment designed to perform a specific task, typically a domestic one."},
        {"word": "applicant", "definition": "A person who makes a formal application for something, especially a job."},
        {"word": "appreciate", "definition": "To recognize the full worth of; to be grateful for."},
        {"word": "approach", "definition": "To come near or nearer to someone or something in distance or time."},
        {"word": "appropriate", "definition": "Suitable or proper in the circumstances."},
        {"word": "approximate", "definition": "Close to the actual, but not completely accurate or exact."},
        {"word": "aquarium", "definition": "A transparent tank of water in which fish and other water creatures and plants are kept."},
        {"word": "arbitrary", "definition": "Based on random choice or personal whim, rather than any reason or system."},
        {"word": "architect", "definition": "A person who designs buildings and in many cases also supervises their construction."},
        {"word": "architectural", "definition": "Relating to the design and construction of buildings."},
        {"word": "argument", "definition": "An exchange of diverging or opposite views, typically a heated or angry one."},
        {"word": "arithmetic", "definition": "The branch of mathematics dealing with the properties and manipulation of numbers."},
        {"word": "arrogant", "definition": "Having or revealing an exaggerated sense of one's own importance or abilities."},
        {"word": "artificial", "definition": "Made or produced by human beings rather than occurring naturally."},
        {"word": "assemble", "definition": "To gather together in one place for a common purpose."},
        {"word": "assembly", "definition": "A group of people gathered together in one place for a common purpose."},
        {"word": "assess", "definition": "To evaluate or estimate the nature, ability, or quality of something."},
        {"word": "asset", "definition": "A useful or valuable thing, person, or quality."},
        {"word": "assign", "definition": "To allocate a job or duty to someone."},
        {"word": "assist", "definition": "To help someone, typically by doing a share of the work."},
        {"word": "associate", "definition": "To connect someone or something with something else in one's mind."},
        {"word": "assume", "definition": "To suppose that something is the case, without proof."},
        {"word": "assurance", "definition": "A positive declaration intended to give confidence."},
        {"word": "athletic", "definition": "Physically strong, fit, and active."},
        {"word": "atmosphere", "definition": "The envelope of gases surrounding the earth or another planet."},
        {"word": "attach", "definition": "To fasten or join something to something else."},
        {"word": "attain", "definition": "To succeed in achieving something that one desires and has worked for."},
        {"word": "attempt", "definition": "An act of trying to do something, typically one that is unsuccessful or difficult."},
        {"word": "attendance", "definition": "The action or state of going regularly to or being present at a place or event."},
        {"word": "attentive", "definition": "Paying close attention to something."},
        {"word": "attorney", "definition": "A person, typically a lawyer, appointed to act for another in business or legal matters."},
        {"word": "attract", "definition": "To cause someone to have a liking for or interest in something."},
        {"word": "attribute", "definition": "A quality or feature regarded as a characteristic or inherent part of someone or something."},
        {"word": "audible", "definition": "Able to be heard."},
        {"word": "audience", "definition": "The assembled spectators or listeners at a public event, such as a play, movie, concert, or meeting."},
        {"word": "authentic", "definition": "Of undisputed origin; genuine."}
      ]
    },
    {
      "week_id": 3,
      "words_data": [
        {"word": "bacteria", "definition": "Unicellular microorganisms which have cell walls but lack organelles and an organized nucleus."},
        {"word": "bankrupt", "definition": "Declared in law unable to pay outstanding debts."},
        {"word": "barometer", "definition": "An instrument measuring atmospheric pressure, used especially in forecasting the weather."},
        {"word": "barrier", "definition": "A fence or other obstacle that prevents movement or access."},
        {"word": "basis", "definition": "The underlying support or foundation for an idea, argument, or process."},
        {"word": "behavior", "definition": "The way in which one acts or conducts oneself, especially toward others."},
        {"word": "beneficial", "definition": "Favorable or advantageous; resulting in good."},
        {"word": "benefit", "definition": "An advantage or profit gained from something."},
        {"word": "betray", "definition": "To be disloyal to one's country, a person, or an ideology by helping an enemy."},
        {"word": "beverage", "definition": "A drink, especially one other than water."},
        {"word": "bias", "definition": "Prejudice in favor of or against one thing, person, or group compared with another."},
        {"word": "bibliography", "definition": "A list of the books of a specific author or publisher, or on a specific subject."},
        {"word": "bicycle", "definition": "A vehicle consisting of two wheels held in a frame one behind the other, propelled by pedals."},
        {"word": "biography", "definition": "An account of someone's life written by someone else."},
        {"word": "biology", "definition": "The scientific study of life and of living organisms."},
        {"word": "blizzard", "definition": "A severe snowstorm with high winds and low visibility."},
        {"word": "boundary", "definition": "A line that marks the limits of an area; a dividing line."},
        {"word": "boycott", "definition": "To withdraw from commercial or social relations with a country or organization as a punishment or protest."},
        {"word": "brochure", "definition": "A small book or magazine containing pictures and information about a product or service."},
        {"word": "bronchitis", "definition": "Inflammation of the mucous membrane in the bronchial tubes."},
        {"word": "brilliant", "definition": "Exceptionally clever or talented; exceptionally bright or radiant."},
        {"word": "browse", "definition": "To survey goods or text in a leisurely way."},
        {"word": "budget", "definition": "An estimate of income and expenditure for a set period of time."},
        {"word": "bulletin", "definition": "A short official statement or summary of news."},
        {"word": "bureaucracy", "definition": "A system of government in which most of the important decisions are made by state officials rather than by elected representatives."},
        {"word": "burglary", "definition": "Entry into a building illegally with intent to commit a crime, especially theft."},
        {"word": "business", "definition": "A person's regular occupation, profession, or trade."},
        {"word": "calculate", "definition": "To determine the amount or number of something mathematically."},
        {"word": "campaign", "definition": "A series of military operations intended to achieve a particular objective, or a series of actions for a social goal."},
        {"word": "capacity", "definition": "The maximum amount that something can contain."},
        {"word": "capital", "definition": "The most important city or town of a country or region; also wealth in the form of money or assets."},
        {"word": "capitol", "definition": "A building in which a state legislative body meets."},
        {"word": "capsule", "definition": "A small case or container, especially a medicine dose or a spacecraft cabin."},
        {"word": "caption", "definition": "A title or brief explanation accompanying an illustration, cartoon, or poster."},
        {"word": "captivate", "definition": "To attract and hold the interest and attention of; charm."},
        {"word": "capture", "definition": "To take into one's possession or control by force."},
        {"word": "cardinal", "definition": "Of greatest importance; fundamental."},
        {"word": "career", "definition": "An occupation undertaken for a significant period of a person's life and with opportunities for progress."},
        {"word": "catalog", "definition": "A complete list of items, typically one in alphabetical or other systematic order."},
        {"word": "catastrophe", "definition": "An event causing great and often sudden damage or suffering; a disaster."}
      ]
    },
    {
      "week_id": 4,
      "words_data": [
        {"word": "category", "definition": "A class or division of people or things regarded as having particular shared characteristics."},
        {"word": "caution", "definition": "Care taken to avoid danger or mistakes."},
        {"word": "cavalry", "definition": "Soldiers who fought on horseback in the past."},
        {"word": "cease", "definition": "To bring or come to an end."},
        {"word": "celebrity", "definition": "A famous person."},
        {"word": "cellar", "definition": "A room below ground level in a house, typically used for storing wine or coal."},
        {"word": "censor", "definition": "An official who examines material that is about to be published and suppresses any parts that are considered obscene or politically unacceptable."},
        {"word": "census", "definition": "An official count or survey of a population, typically recording various details of individuals."},
        {"word": "centennial", "definition": "Relating to a hundredth anniversary."},
        {"word": "ceremony", "definition": "A formal religious or public occasion, typically one celebrating a particular event or anniversary."},
        {"word": "certainty", "definition": "Firm conviction that something is the case."},
        {"word": "challenge", "definition": "A task or situation that tests someone's abilities."},
        {"word": "character", "definition": "The mental and moral qualities distinctive to an individual."},
        {"word": "characteristic", "definition": "A feature or quality belonging typically to a person, place, or thing and serving to identify it."},
        {"word": "charcoal", "definition": "A porous black solid consisting of carbon, used as fuel and for drawing."},
        {"word": "charitable", "definition": "Relating to the assistance of those in need."},
        {"word": "chauffeur", "definition": "A person employed to drive a private or rented automobile."},
        {"word": "chemical", "definition": "Relating to chemistry, or the interactions of substances."},
        {"word": "chemist", "definition": "A person engaged in chemical research or experiments."},
        {"word": "cherish", "definition": "To protect and care for someone lovingly."},
        {"word": "chief", "definition": "A leader or ruler of a people or clan."},
        {"word": "chisel", "definition": "A long-bladed hand tool used for cutting or shaping wood, stone, or metal."},
        {"word": "chronic", "definition": "Persisting for a long time or constantly recurring."},
        {"word": "chronological", "definition": "Starting with the earliest and following the order in which they occurred."},
        {"word": "circuit", "definition": "A roughly circular line, route, or movement that starts and finishes at the same place."},
        {"word": "circulate", "definition": "To move continuously or freely through a closed system or area."},
        {"word": "circumference", "definition": "The enclosing boundary of a curved geometric figure, especially a circle."},
        {"word": "circumstance", "definition": "A fact or condition connected with or relevant to an event or action."},
        {"word": "citizen", "definition": "A legally recognized subject or national of a state or commonwealth."},
        {"word": "civil", "definition": "Relating to ordinary citizens and their concerns, as distinct from military or ecclesiastical matters."},
        {"word": "civilian", "definition": "A person not in the armed services or the police force."},
        {"word": "civilization", "definition": "The stage of human social and cultural development and organization that is considered most advanced."},
        {"word": "civilize", "definition": "To bring a place or people to a stage of social and cultural development considered to be more advanced."},
        {"word": "clarify", "definition": "To make a statement or situation less confused and more clearly comprehensible."},
        {"word": "classic", "definition": "Judged over a period of time to be of the highest quality and outstanding of its kind."},
        {"word": "classify", "definition": "To arrange a group of people or things in classes or categories according to shared qualities or characteristics."},
        {"word": "clause", "definition": "A unit of grammatical organization next below the sentence in rank and in traditional grammar said to consist of a subject and predicate."},
        {"word": "clientele", "definition": "Clients collectively."},
        {"word": "climate", "definition": "The weather conditions prevailing in an area in general or over a long period."},
        {"word": "climax", "definition": "The most intense, exciting, or important point of something."}
      ]
    },
    {
      "week_id": 5,
      "words_data": [
        {"word": "clinic", "definition": "An establishment or hospital department where outpatients are given medical treatment or advice."},
        {"word": "clique", "definition": "A small, exclusive group of people."},
        {"word": "coarse", "definition": "Rough or loose in texture or grain."},
        {"word": "code", "definition": "A system of words, letters, figures, or other symbols used to represent others, especially for the purposes of secrecy."},
        {"word": "coexist", "definition": "To exist at the same time or in the same place."},
        {"word": "coherent", "definition": "Logical and consistent."},
        {"word": "coincide", "definition": "To occur at or during the same time."},
        {"word": "collaborate", "definition": "To work jointly on an activity, especially to produce or create something."},
        {"word": "collapse", "definition": "To fall down or in; give way."},
        {"word": "colleague", "definition": "A person with whom one works, typically in a profession or business."},
        {"word": "collection", "definition": "The action or process of collecting someone or something."},
        {"word": "collide", "definition": "To hit with force when moving."},
        {"word": "colonel", "definition": "An army officer of high rank, above a lieutenant colonel."},
        {"word": "colonial", "definition": "Relating to or characteristic of a colony or colonies."},
        {"word": "colony", "definition": "A country or area under the full or partial political control of another country."},
        {"word": "column", "definition": "An upright pillar, typically cylindrical and made of stone or concrete, supporting an entablature, arch, or other structure or standing alone as a monument."},
        {"word": "combat", "definition": "Fighting between armed forces."},
        {"word": "combine", "definition": "To unite; to merge together."},
        {"word": "comedian", "definition": "An entertainer whose design or office is to induce laughter."},
        {"word": "comedy", "definition": "Professional entertainment consisting of jokes and satirical sketches, intended to make an audience laugh."},
        {"word": "commemorate", "definition": "To recall and show respect for someone or something in a ceremony."},
        {"word": "commence", "definition": "To begin or start."},
        {"word": "comment", "definition": "A verbal or written remark expressing an opinion or reaction."},
        {"word": "commerce", "definition": "The activity of buying and selling, especially on a large scale."},
        {"word": "commission", "definition": "An instruction, command, or duty given to a person or group of people."},
        {"word": "commit", "definition": "To carry out or perpetrate a mistake, crime, or immoral act."},
        {"word": "committee", "definition": "A group of people appointed for a specific function, typically consisting of members of a larger group."},
        {"word": "communicate", "definition": "To share or exchange information, news, or ideas."},
        {"word": "community", "definition": "A group of people living in the same place or having a particular characteristic in common."},
        {"word": "compact", "definition": "Closely and neatly packed together; dense."},
        {"word": "comparable", "definition": "Able to be likened to another; similar."},
        {"word": "comparative", "definition": "Measured or judged by estimating the similarity or difference between one thing and another."},
        {"word": "comparison", "definition": "A consideration or estimate of the similarities or dissimilarities between two things or people."},
        {"word": "compass", "definition": "An instrument containing a magnetized pointer that shows the direction of magnetic north."},
        {"word": "compassion", "definition": "Sympathetic pity and concern for the sufferings or misfortunes of others."},
        {"word": "compatible", "definition": "Able to exist or occur together without conflict."},
        {"word": "compel", "definition": "To force or oblige someone to do something."},
        {"word": "compensate", "definition": "To give someone something, typically money, in recognition of loss, suffering, or injury."},
        {"word": "compete", "definition": "To strive to gain or win something by defeating or establishing superiority over others."},
        {"word": "competent", "definition": "Having the necessary ability, knowledge, or skill to do something successfully."}
      ]
    },
    {
      "week_id": 6,
      "words_data": [
        {"word": "competition", "definition": "The activity or condition of competing."},
        {"word": "compile", "definition": "To produce something, especially a list, report, or book, by assembling information collected from other sources."},
        {"word": "complement", "definition": "A thing that completes or brings to perfection."},
        {"word": "complex", "definition": "Consisting of many different and connected parts."},
        {"word": "component", "definition": "A part or element of a larger whole, especially a part of a machine or vehicle."},
        {"word": "compose", "definition": "To write or create a work of art, especially music or poetry."},
        {"word": "comprehend", "definition": "To grasp mentally; understand."},
        {"word": "comprehensive", "definition": "Complete; including all or nearly all elements or aspects of something."},
        {"word": "compress", "definition": "To flatten by pressure; squeeze or press."},
        {"word": "comprise", "definition": "To consist of; be made up of."},
        {"word": "compromise", "definition": "An agreement or a settlement of a dispute that is reached by each side making concessions."},
        {"word": "compulsory", "definition": "Required by law or a rule; obligatory."},
        {"word": "conceal", "definition": "To keep from sight; hide."},
        {"word": "concede", "definition": "To admit that something is true or valid after first denying or resisting it."},
        {"word": "conceive", "definition": "To form or devise a plan or idea in the mind."},
        {"word": "concentrate", "definition": "To focus one's attention or mental effort on a particular object or activity."},
        {"word": "concept", "definition": "An abstract idea; a general notion."},
        {"word": "concern", "definition": "Anxiety; worry."},
        {"word": "concert", "definition": "A musical performance given in public, typically by several performers or of several separate compositions."},
        {"word": "conclude", "definition": "To bring something to an end."},
        {"word": "concrete", "definition": "Existing in a material or physical form; not abstract."},
        {"word": "conduct", "definition": "The manner in which a person behaves, especially on a particular occasion or in a particular context."},
        {"word": "confer", "definition": "To grant or bestow a title, degree, benefit, or right."},
        {"word": "conference", "definition": "A formal meeting for discussion."},
        {"word": "confess", "definition": "To admit that one has committed a crime or done something wrong."},
        {"word": "confide", "definition": "To tell someone about a secret or private matter while trusting them not to repeat it to others."},
        {"word": "confidence", "definition": "The feeling or belief that one can rely on someone or something; firm trust."},
        {"word": "confident", "definition": "Feeling or showing confidence in oneself; self-assured."},
        {"word": "confidential", "definition": "Intended to be kept secret."},
        {"word": "confine", "definition": "To keep or restrict someone or something within certain limits of space, scope, quantity, or time."},
        {"word": "confirm", "definition": "To establish the truth or correctness of something previously believed, suspected, or feared to be the case."},
        {"word": "conflict", "definition": "A serious disagreement or argument, typically a protracted one."},
        {"word": "conform", "definition": "To comply with rules, standards, or laws."},
        {"word": "confront", "definition": "To meet someone face to face with hostile or argumentative intent."},
        {"word": "confuse", "definition": "To cause someone to become bewildered or perplexed."},
        {"word": "congratulate", "definition": "To express praise for an achievement or good fortune to someone."},
        {"word": "congregate", "definition": "To gather into a crowd or mass."},
        {"word": "congress", "definition": "The national legislative body of a country, especially the US."},
        {"word": "conjunction", "definition": "A word used to connect clauses or sentences or to coordinate words in the same clause."},
        {"word": "conquer", "definition": "To overcome and take control of a place or people by use of military force."}
      ]
    },
    {
      "week_id": 7,
      "words_data": [
        {"word": "conscience", "definition": "An inner feeling or voice viewed as acting as a guide to the rightness or wrongness of one's behavior."},
        {"word": "conscientious", "definition": "Wishing to do what is right, especially to do one's work or duty well and thoroughly."},
        {"word": "conscious", "definition": "Aware of and responding to one's surroundings; awake."},
        {"word": "consecutive", "definition": "Following each other continuously."},
        {"word": "consensus", "definition": "General agreement."},
        {"word": "consent", "definition": "Permission for something to happen or agreement to do something."},
        {"word": "conserve", "definition": "To protect something, especially an environmentally or culturally important place or thing, from harm or destruction."},
        {"word": "consider", "definition": "To think carefully about something, typically before making a decision."},
        {"word": "consist", "definition": "To be composed or made up of."},
        {"word": "consistent", "definition": "Acting or done in the same way over time, especially so as to be fair or accurate."},
        {"word": "consolidate", "definition": "To make something physically stronger or more solid."},
        {"word": "consonant", "definition": "A basic speech sound in which the breath is at least partly obstructed and which can be combined with a vowel to form a syllable."},
        {"word": "conspicuous", "definition": "Standing out so as to be clearly visible."},
        {"word": "constant", "definition": "Occurring continuously over a period of time."},
        {"word": "constitute", "definition": "To be a part of a whole."},
        {"word": "constrain", "definition": "To severely restrict the scope, extent, or activity of."},
        {"word": "construct", "definition": "To build or erect something, typically a building, road, or machine."},
        {"word": "consult", "definition": "To seek information or advice from someone with expertise in a particular area."},
        {"word": "consume", "definition": "To eat, drink, or ingest food or drink."},
        {"word": "contact", "definition": "The state or condition of physical touching."},
        {"word": "contagious", "definition": "Of a disease spread from one person or organism to another by direct or indirect contact."},
        {"word": "contain", "definition": "To have or hold someone or something within."},
        {"word": "contaminate", "definition": "To make something impure by exposure to or addition of a poisonous or polluting substance."},
        {"word": "contemplate", "definition": "To look thoughtfully for a long time at something."},
        {"word": "contemporary", "definition": "Living or occurring at the same time."},
        {"word": "contempt", "definition": "The feeling that a person or a thing is beneath consideration, worthless, or deserving scorn."},
        {"word": "content", "definition": "In a state of peaceful happiness."},
        {"word": "contest", "definition": "An event in which people compete for supremacy in a sport, activity, or particular quality."},
        {"word": "context", "definition": "The circumstances that form the setting for an event, statement, or idea, and in terms of which it can be fully understood."},
        {"word": "continent", "definition": "Any of the world's main continuous expanses of land."},
        {"word": "continual", "definition": "Frequently recurring; always happening."},
        {"word": "continue", "definition": "To persist in an activity or process."},
        {"word": "contradict", "definition": "To deny the truth of a statement, especially by asserting the opposite."},
        {"word": "contrary", "definition": "Opposite in nature, direction, or meaning."},
        {"word": "contrast", "definition": "The state of being strikingly different from something else in juxtaposition or close association."},
        {"word": "contribute", "definition": "To give something, especially money, in order to help achieve or provide something."},
        {"word": "contrive", "definition": "To create or bring about an object or a situation by deliberate use of skill and artifice."},
        {"word": "control", "definition": "The power to influence or direct people's behavior or the course of events."},
        {"word": "controversy", "definition": "Disagreement, typically when prolonged, public, and heated."},
        {"word": "convene", "definition": "To come or bring together for a meeting or activity; assemble."}
      ]
    },
    {
      "week_id": 8,
      "words_data": [
        {"word": "convenient", "definition": "Fitting in well with a person's needs or activities."},
        {"word": "convention", "definition": "A large meeting or conference, especially of members of a political party or a particular profession."},
        {"word": "conventional", "definition": "Based on or in accordance with what is generally done or believed."},
        {"word": "converse", "definition": "To engage in conversation."},
        {"word": "convert", "definition": "To cause to change in form, character, or function."},
        {"word": "convey", "definition": "To transport or carry to a place."},
        {"word": "convict", "definition": "To declare someone to be guilty of a criminal offense by the verdict of a jury or the decision of a judge in a court of law."},
        {"word": "convince", "definition": "To cause someone to believe firmly in the truth of something."},
        {"word": "cooperate", "definition": "To work together toward the same end."},
        {"word": "coordinate", "definition": "To bring the different elements of a complex activity or organization into a harmonious or efficient relationship."},
        {"word": "cope", "definition": "To deal effectively with something difficult."},
        {"word": "corporate", "definition": "Relating to a large company or group."},
        {"word": "corps", "definition": "A main subdivision of an army in the field, consisting of two or more divisions."},
        {"word": "corpse", "definition": "A dead body, especially of a human being rather than an animal."},
        {"word": "correspond", "definition": "To have a close similarity; match or agree almost exactly."},
        {"word": "corridor", "definition": "A long passage in a building from which doors lead into rooms."},
        {"word": "corrode", "definition": "To destroy or damage a metal, stone, or other material slowly by chemical action."},
        {"word": "corrupt", "definition": "Having or showing a willingness to act dishonestly in return for money or personal gain."},
        {"word": "council", "definition": "An advisory, deliberative, or legislative body of people formally constituted and meeting regularly."},
        {"word": "counsel", "definition": "Advice, especially that given formally."},
        {"word": "counter", "definition": "A long flat-topped fixture in a store or bank across which business is conducted with customers."},
        {"word": "coupon", "definition": "A voucher entitling the holder to a discount for a particular product."},
        {"word": "courteous", "definition": "Polite, respectful, or considerate in manner."},
        {"word": "coverage", "definition": "The extent to which something deals with or applies to something else."},
        {"word": "covert", "definition": "Not openly acknowledged or displayed."},
        {"word": "coward", "definition": "A person who lacks the courage to do or endure dangerous or unpleasant things."},
        {"word": "cradle", "definition": "A small bed for a baby, in particular one that rocks on pivots."},
        {"word": "craft", "definition": "An activity involving skill in making things by hand."},
        {"word": "cram", "definition": "To completely fill a place or container to the point that it appears to be overflowing."},
        {"word": "cranky", "definition": "Bad-tempered; irritable."},
        {"word": "crater", "definition": "A large, bowl-shaped cavity in the ground or on the surface of a planet or the moon, typically one caused by an explosion or the impact of a meteorite."},
        {"word": "crave", "definition": "To feel a powerful desire for something."},
        {"word": "crease", "definition": "A line or ridge produced on paper or cloth by folding, pressing, or crushing it."},
        {"word": "create", "definition": "To bring something into existence."},
        {"word": "credible", "definition": "Able to be believed; convincing."},
        {"word": "credit", "definition": "The ability of a customer to obtain goods or services before payment, based on the trust that payment will be made in the future."},
        {"word": "creed", "definition": "A system of Christian or other religious belief; a faith."},
        {"word": "creek", "definition": "A natural stream of water smaller than a river."},
        {"word": "crest", "definition": "The top of a mountain or hill."},
        {"word": "crew", "definition": "A group of people who work on and operate a ship, aircraft, or train."}
      ]
    },
    {
      "week_id": 9,
      "words_data": [
        {"word": "criminal", "definition": "A person who has committed a crime."},
        {"word": "criterion", "definition": "A principle or standard by which something may be judged or decided."},
        {"word": "critic", "definition": "A person who expresses an unfavorable opinion of something."},
        {"word": "critical", "definition": "Expressing adverse or disapproving comments or judgments."},
        {"word": "criticize", "definition": "To indicate the faults of someone or something in a disapproving way."},
        {"word": "crucial", "definition": "Decisive or critical, especially in the success or failure of something."},
        {"word": "crude", "definition": "In a natural or raw state; not yet processed or refined."},
        {"word": "cruelty", "definition": "Callous indifference to or pleasure in causing pain and suffering."},
        {"word": "cruise", "definition": "A voyage on a ship or boat taken for pleasure or as a vacation and usually calling at several places."},
        {"word": "culinary", "definition": "Of or for cooking."},
        {"word": "culminate", "definition": "To reach a climax or point of highest development."},
        {"word": "culprit", "definition": "A person who is responsible for a crime or other misdeed."},
        {"word": "cultivate", "definition": "To prepare and use land for crops or gardening."},
        {"word": "culture", "definition": "The arts and other manifestations of human intellectual achievement regarded collectively."},
        {"word": "cumulative", "definition": "Increasing or increased in quantity, degree, or force by successive additions."},
        {"word": "cunning", "definition": "Having or showing skill in achieving one's ends by deceit or evasion."},
        {"word": "curator", "definition": "A keeper or custodian of a museum or other collection."},
        {"word": "curfew", "definition": "A regulation requiring people to remain indoors between specified hours, typically at night."},
        {"word": "currency", "definition": "A system of money in general use in a particular country."},
        {"word": "curriculum", "definition": "The subjects comprising a course of study in a school or college."},
        {"word": "curtail", "definition": "To reduce in extent or quantity; impose a restriction on."},
        {"word": "custody", "definition": "The protective care or guardianship of someone or something."},
        {"word": "cyclone", "definition": "A system of winds rotating inward to an area of low atmospheric pressure, with a counterclockwise or clockwise circulation."},
        {"word": "cylinder", "definition": "A solid geometric figure with straight parallel sides and a circular or oval cross section."},
        {"word": "cynical", "definition": "Believing that people are motivated by self-interest; distrustful of human sincerity or integrity."},
        {"word": "dairy", "definition": "A building or room for the processing, storage, and distribution of milk and milk products."},
        {"word": "damage", "definition": "Physical harm caused to something in such a way as to impair its value, usefulness, or normal function."},
        {"word": "dazzle", "definition": "To amaze or overwhelm someone with a particular impressive quality."},
        {"word": "debate", "definition": "A formal discussion on a particular topic in a public meeting or legislative assembly, in which opposing arguments are put forward."},
        {"word": "decade", "definition": "A period of ten years."},
        {"word": "decay", "definition": "The state or process of rotting or decomposition."},
        {"word": "deceit", "definition": "The action or practice of deceiving someone by concealing or misrepresenting the truth."},
        {"word": "deceive", "definition": "To cause someone to believe something that is not true, typically in order to gain some personal advantage."},
        {"word": "decent", "definition": "Conforming with generally accepted standards of respectable or moral behavior."},
        {"word": "deception", "definition": "The action of deceiving someone."},
        {"word": "decide", "definition": "To come to a resolution in the mind as a result of consideration."},
        {"word": "decimal", "definition": "Relating to or denoting a system of numbers and arithmetic based on the number ten, tenth parts, and powers of ten."},
        {"word": "declaration", "definition": "A formal or explicit statement or announcement."},
        {"word": "decline", "definition": "To become smaller, fewer, or less; decrease."},
        {"word": "decorate", "definition": "To make something look more attractive by adding extra items or images to it."}
      ]
    },
    {
      "week_id": 10,
      "words_data": [
        {"word": "decrease", "definition": "To make or become smaller or fewer in size, amount, intensity, or degree."},
        {"word": "decree", "definition": "An official order issued by a legal authority."},
        {"word": "dedicate", "definition": "To devote time, effort, or oneself to a particular task or purpose."},
        {"word": "deduct", "definition": "To subtract or take away an amount or part from a total."},
        {"word": "deem", "definition": "To regard or consider in a specified way."},
        {"word": "defeat", "definition": "To win a victory over someone in a battle or other contest; overcome."},
        {"word": "defect", "definition": "A shortcoming, imperfection, or lack."},
        {"word": "defend", "definition": "To resist an attack made on someone or something; protect from harm or danger."},
        {"word": "defer", "definition": "To put off an action or event to a later time; postpone."},
        {"word": "defiance", "definition": "Open resistance; bold disobedience."},
        {"word": "deficient", "definition": "Not having enough of a specified quality or ingredient."},
        {"word": "define", "definition": "To state or describe exactly the nature, scope, or meaning of."},
        {"word": "definite", "definition": "Clearly stated or decided; not vague or doubtful."},
        {"word": "deflect", "definition": "To cause something to change direction by interposing something; turn aside from a straight course."},
        {"word": "defy", "definition": "To openly resist or refuse to obey."},
        {"word": "degrade", "definition": "To treat or regard someone with contempt or disrespect."},
        {"word": "delegate", "definition": "A person sent or authorized to represent others, in particular an elected representative sent to a conference."},
        {"word": "deliberate", "definition": "Done consciously and intentionally."},
        {"word": "delicate", "definition": "Very fine in texture or structure; of intricate workmanship or quality."},
        {"word": "delinquent", "definition": "Showing or characterized by a tendency to commit crime, particularly minor crime."},
        {"word": "deliver", "definition": "To bring and hand over a letter, package, or ordered goods to the proper recipient or address."},
        {"word": "deluge", "definition": "A severe flood."},
        {"word": "demand", "definition": "An insistent and peremptory request, made as if by right."},
        {"word": "democracy", "definition": "A system of government by the whole population or all the eligible members of a state, typically through elected representatives."},
        {"word": "demolish", "definition": "To pull or knock down a building."},
        {"word": "demonstrate", "definition": "To clearly show the existence or truth of something by giving proof or evidence."},
        {"word": "denial", "definition": "The action of declaring something to be untrue."},
        {"word": "dense", "definition": "Closely compacted in substance."},
        {"word": "deny", "definition": "To state that one refuses to admit the truth or existence of."},
        {"word": "depart", "definition": "To leave, typically in order to start a journey."},
        {"word": "dependent", "definition": "Requiring someone or something for financial, emotional, or other support."},
        {"word": "depict", "definition": "To show or represent by a drawing, painting, or other art form."},
        {"word": "deport", "definition": "To expel a foreigner from a country, typically on the grounds of illegal status or for having committed a crime."},
        {"word": "deposit", "definition": "A sum of money placed or kept in a bank account, usually to gain interest."},
        {"word": "depot", "definition": "A place for the storage of large quantities of equipment, food, or some other commodity."},
        {"word": "depress", "definition": "To make someone feel utterly dispirited or dejected."},
        {"word": "deprive", "definition": "To deny a person or place the possession or use of something."},
        {"word": "derive", "definition": "To obtain something from a specified source."},
        {"word": "descend", "definition": "To move or fall downward."},
        {"word": "describe", "definition": "To give an account in words of someone or something, including all the relevant characteristics, qualities, or events."}
      ]
    },
    {
      "week_id": 11,
      "words_data": [
        {"word": "desert", "definition": "A barren area of landscape where little precipitation occurs and, consequently, living conditions are hostile for plant and animal life."},
        {"word": "deserve", "definition": "To do something or have or show qualities worthy of reward or punishment."},
        {"word": "design", "definition": "A plan or drawing produced to show the look and function or workings of a building, garment, or other object before it is built or made."},
        {"word": "desirable", "definition": "Wanted or wished for as being an attractive, useful, or necessary course of action."},
        {"word": "desolate", "definition": "Of a place deserted of people and in a state of bleak and dismal emptiness."},
        {"word": "despair", "definition": "The complete loss or absence of hope."},
        {"word": "desperate", "definition": "Feeling, showing, or involving a hopeless sense that a situation is so bad as to be impossible to deal with."},
        {"word": "despise", "definition": "To feel contempt or a deep repugnance for."},
        {"word": "despite", "definition": "Without being affected by; in spite of."},
        {"word": "destination", "definition": "The place to which someone or something is going or being sent."},
        {"word": "destiny", "definition": "The events that will necessarily happen to a particular person or thing in the future."},
        {"word": "destitute", "definition": "Without the basic necessities of life."},
        {"word": "destroy", "definition": "To put an end to the existence of something by damaging or attacking it."},
        {"word": "detach", "definition": "To disconnect or separate something from something else."},
        {"word": "detail", "definition": "An individual feature, fact, or item."},
        {"word": "detain", "definition": "To keep someone from proceeding; hold back."},
        {"word": "detect", "definition": "To discover or identify the presence or existence of."},
        {"word": "deter", "definition": "To discourage someone from doing something, typically by instilling doubt or fear of the consequences."},
        {"word": "deteriorate", "definition": "To become progressively worse."},
        {"word": "determine", "definition": "To cause something to occur in a particular way; be the decisive factor in."},
        {"word": "detest", "definition": "To dislike intensely."},
        {"word": "detract", "definition": "To take away from the worth or value of a quality or achievement."},
        {"word": "devastate", "definition": "To destroy or ruin something."},
        {"word": "develop", "definition": "To grow or cause to grow and become more mature, advanced, or elaborate."},
        {"word": "deviate", "definition": "To depart from an established course."},
        {"word": "device", "definition": "A thing made or adapted for a particular purpose, especially a piece of mechanical or electronic equipment."},
        {"word": "devise", "definition": "To plan or invent a complex procedure, system, or mechanism by careful thought."},
        {"word": "devote", "definition": "To give all or a large part of one's time or resources to a person, activity, or cause."},
        {"word": "diagram", "definition": "A simplified drawing showing the appearance, structure, or workings of something; a schematic representation."},
        {"word": "dialect", "definition": "A particular form of a language that is peculiar to a specific region or social group."},
        {"word": "dialogue", "definition": "Conversation between two or more people as a feature of a book, play, or movie."},
        {"word": "dictate", "definition": "To say or read aloud words to be typed, written down, or recorded on tape."},
        {"word": "diction", "definition": "The choice and use of words and phrases in speech or writing."},
        {"word": "differentiate", "definition": "To recognize or ascertain what makes someone or something different."},
        {"word": "difficult", "definition": "Needing much effort or skill to accomplish, deal with, or understand."},
        {"word": "diffuse", "definition": "Spread out over a large area; not concentrated."},
        {"word": "digest", "definition": "To break down food in the alimentary canal into substances that can be absorbed and used by the body."},
        {"word": "digit", "definition": "Any of the numerals from 0 to 9, especially when forming part of a number."},
        {"word": "dignity", "definition": "The state or quality of being worthy of honor or respect."},
        {"word": "dilemma", "definition": "A situation in which a difficult choice has to be made between two or more alternatives, especially equally undesirable ones."}
      ]
    },
    {
      "week_id": 12,
      "words_data": [
        {"word": "diligent", "definition": "Having or showing care and conscientiousness in one's work or duties."},
        {"word": "dimension", "definition": "A measurable extent of some kind, such as length, breadth, depth, or height."},
        {"word": "diminish", "definition": "To make or become less."},
        {"word": "diploma", "definition": "A certificate awarded by an educational establishment to show that someone has successfully completed a course of study."},
        {"word": "diplomat", "definition": "An official representing a country abroad."},
        {"word": "direct", "definition": "Extending or moving from one place to another by the shortest way without changing direction or stopping."},
        {"word": "disable", "definition": "To limit someone in their movements, senses, or activities."},
        {"word": "disadvantage", "definition": "An unfavorable circumstance or condition that reduces the chances of success or effectiveness."},
        {"word": "disagree", "definition": "To have or express a different opinion."},
        {"word": "disappear", "definition": "To cease to be visible."},
        {"word": "disappoint", "definition": "To fail to fulfill the hopes or expectations of someone."},
        {"word": "disaster", "definition": "A sudden event, such as an accident or a natural catastrophe, that causes great damage or loss of life."},
        {"word": "discard", "definition": "To get rid of someone or something as no longer useful or desirable."},
        {"word": "discern", "definition": "To perceive or recognize something."},
        {"word": "discharge", "definition": "To tell someone officially that they can or must leave, typically a hospital or the armed forces."},
        {"word": "discipline", "definition": "The practice of training people to obey rules or a code of behavior, using punishment to correct disobedience."},
        {"word": "disclose", "definition": "To make secret or new information known."},
        {"word": "discomfort", "definition": "Slight pain."},
        {"word": "discount", "definition": "A deduction from the usual cost of something, typically given for prompt or remote payment or to a special category of buyers."},
        {"word": "discourage", "definition": "To cause someone to lose confidence or enthusiasm."},
        {"word": "discover", "definition": "To find unexpectedly or during a search."},
        {"word": "discreet", "definition": "Careful and circumspect in one's speech or actions, especially in order to avoid causing offense or to gain an advantage."},
        {"word": "discriminate", "definition": "To make an unjust or prejudicial distinction in the treatment of different categories of people or things, especially on the grounds of race, sex, or age."},
        {"word": "discuss", "definition": "To talk about something with another person or group of people."},
        {"word": "disdain", "definition": "The feeling that someone or something is unworthy of one's consideration or respect; contempt."},
        {"word": "disease", "definition": "A disorder of structure or function in a human, animal, or plant, especially one that produces specific signs or symptoms or that affects a specific location and is not simply a direct result of physical injury."},
        {"word": "disgrace", "definition": "Loss of reputation or respect, especially as the result of a dishonorable action."},
        {"word": "disguise", "definition": "To give a new appearance to a person or thing to hide its true form."},
        {"word": "disgust", "definition": "A feeling of revulsion or strong disapproval aroused by something unpleasant or offensive."},
        {"word": "dishonest", "definition": "Behaving or prone to behave in an untrustworthy or fraudulent way."},
        {"word": "disillusion", "definition": "To cause someone to realize that a belief or an ideal is false."},
        {"word": "disinfect", "definition": "To clean something, especially with a chemical liquid, in order to destroy bacteria."},
        {"word": "dismal", "definition": "Depressing; dreary."},
        {"word": "dismiss", "definition": "To send someone away; to order someone to leave."},
        {"word": "disobey", "definition": "To fail to obey rules or someone in authority."},
        {"word": "disorder", "definition": "A state of confusion."},
        {"word": "dispatch", "definition": "To send off to a destination or for a purpose."},
        {"word": "dispense", "definition": "To distribute or provide a service or information to a number of people."},
        {"word": "disperse", "definition": "To distribute or spread over a wide area."},
        {"word": "displace", "definition": "To take over the place, position, or role of someone or something."}
      ]
    },
    {
      "week_id": 13,
      "words_data": [
        {"word": "display", "definition": "A collection of objects arranged for public viewing."},
        {"word": "disposal", "definition": "The action or process of throwing away or getting rid of something."},
        {"word": "dispose", "definition": "To get rid of by throwing away or giving or selling to someone else."},
        {"word": "dispute", "definition": "A disagreement, argument, or debate."},
        {"word": "disqualify", "definition": "To pronounce someone as ineligible for an office, privilege, or competition because of an offense or infringement."},
        {"word": "disregard", "definition": "To pay no attention to; ignore."},
        {"word": "disrupt", "definition": "To interrupt an event, activity, or process by causing a disturbance or problem."},
        {"word": "dissect", "definition": "To methodically cut up a body, part, or plant in order to study its internal parts."},
        {"word": "dissent", "definition": "The expression or holding of opinions at variance with those previously, commonly, or officially held."},
        {"word": "dissolve", "definition": "To become or cause to become incorporated into a liquid so as to form a solution."},
        {"word": "distance", "definition": "An amount of space between two things or people."},
        {"word": "distinct", "definition": "Recognizably different in nature from something else of a similar type."},
        {"word": "distinguish", "definition": "To perceive or point out a difference."},
        {"word": "distort", "definition": "To pull or twist out of shape."},
        {"word": "distract", "definition": "To prevent someone from giving full attention to something."},
        {"word": "distress", "definition": "Extreme anxiety, sorrow, or pain."},
        {"word": "distribute", "definition": "To give shares of something; deal out."},
        {"word": "district", "definition": "An area of a country or city, especially one regarded as a distinct unit because of a particular characteristic."},
        {"word": "disturb", "definition": "To interrupt the sleep, relaxation, or privacy of someone."},
        {"word": "diverse", "definition": "Showing a great deal of variety; very different."},
        {"word": "divert", "definition": "To cause someone or something to change course or turn from one direction to another."},
        {"word": "divide", "definition": "To separate or be separated into parts."},
        {"word": "divine", "definition": "Of, from, or like God or a god."},
        {"word": "division", "definition": "The action of separating something into parts or the process of being separated."},
        {"word": "divorce", "definition": "The legal dissolution of a marriage by a court or other competent body."},
        {"word": "document", "definition": "A piece of written, printed, or electronic matter that provides information or evidence or that serves as an official record."},
        {"word": "domain", "definition": "An area of territory owned or controlled by a ruler or government."},
        {"word": "domestic", "definition": "Relating to the running of a home or to family relations."},
        {"word": "dominant", "definition": "Most important, powerful, or influential."},
        {"word": "dominate", "definition": "To have a commanding influence on; exercise control over."},
        {"word": "donate", "definition": "To give money or goods for a good cause, for example to a charity."},
        {"word": "doom", "definition": "Death, destruction, or some other terrible fate."},
        {"word": "dormant", "definition": "Having normal physical functions suspended or slowed down for a period of time; in or as if in a deep sleep."},
        {"word": "dose", "definition": "A quantity of a medicine or drug taken or recommended to be taken at a particular time."},
        {"word": "draft", "definition": "A preliminary version of a piece of writing."},
        {"word": "drain", "definition": "To cause the water or other liquid in something to run out, leaving it empty, dry, or relatively dry."},
        {"word": "dramatic", "definition": "Relating to drama or the performance or study of drama."},
        {"word": "drastic", "definition": "Likely to have a strong or far-reaching effect; radical and extreme."},
        {"word": "drawback", "definition": "A feature that renders something less acceptable; a disadvantage or problem."},
        {"word": "dreadful", "definition": "Causing or involving great suffering, fear, or unhappiness; extremely bad or serious."}
      ]
    },
    {
      "week_id": 14,
      "words_data": [
        {"word": "drought", "definition": "A prolonged period of abnormally low rainfall, leading to a shortage of water."},
        {"word": "drowsy", "definition": "Sleepy and lethargic; half asleep."},
        {"word": "dual", "definition": "Consisting of two parts, elements, or aspects."},
        {"word": "dubious", "definition": "Hesitating or doubting."},
        {"word": "duplicate", "definition": "Exactly like something else, especially through having been copied."},
        {"word": "duration", "definition": "The time during which something continues."},
        {"word": "dwell", "definition": "To live in or at a specified place."},
        {"word": "dwindle", "definition": "To diminish gradually in size, amount, or strength."},
        {"word": "dynamic", "definition": "Characterized by constant change, activity, or progress."},
        {"word": "eager", "definition": "Wanting to do or have something very much."},
        {"word": "earnest", "definition": "Resulting from or showing sincere and intense conviction."},
        {"word": "earnings", "definition": "Money obtained in return for labor or services."},
        {"word": "eavesdrop", "definition": "To secretly listen to a conversation."},
        {"word": "eccentric", "definition": "Unconventional and slightly strange."},
        {"word": "echo", "definition": "A sound or series of sounds caused by the reflection of sound waves from a surface back to the listener."},
        {"word": "ecology", "definition": "The branch of biology that deals with the relations of organisms to one another and to their physical surroundings."},
        {"word": "economy", "definition": "The wealth and resources of a country or region, especially in terms of the production and consumption of goods and services."},
        {"word": "ecstatic", "definition": "Feeling or expressing overwhelming happiness or joyful excitement."},
        {"word": "edible", "definition": "Fit to be eaten."},
        {"word": "edifice", "definition": "A building, especially a large, imposing one."},
        {"word": "editor", "definition": "A person who is in charge of and determines the final content of a text, particularly a newspaper or magazine."},
        {"word": "educate", "definition": "To give intellectual, moral, and social instruction to someone, typically at a school or university."},
        {"word": "effect", "definition": "A change which is a result or consequence of an action or other cause."},
        {"word": "effective", "definition": "Successful in producing a desired or intended result."},
        {"word": "efficient", "definition": "Achieving maximum productivity with minimum wasted effort or expense."},
        {"word": "effort", "definition": "A vigorous or determined attempt."},
        {"word": "ego", "definition": "A person's sense of self-esteem or self-importance."},
        {"word": "elaborate", "definition": "Involving many carefully arranged parts or details; detailed and complicated in design and planning."},
        {"word": "elastic", "definition": "Able to resume its normal shape spontaneously after contraction, dilatation, or distortion."},
        {"word": "elated", "definition": "Make someone ecstatically happy."},
        {"word": "elderly", "definition": "Old or aging."},
        {"word": "elect", "definition": "To choose someone to hold public office or some other position by voting."},
        {"word": "elegant", "definition": "Pleasingly graceful and stylish in appearance or manner."},
        {"word": "element", "definition": "A part or aspect of something abstract, especially one that is essential or characteristic."},
        {"word": "elementary", "definition": "Relating to the most rudimentary aspects of a subject."},
        {"word": "elevate", "definition": "To raise or lift something up to a higher position."},
        {"word": "elicit", "definition": "To evoke or draw out a response, answer, or fact from someone in reaction to one's own actions or questions."},
        {"word": "eligible", "definition": "Having the right to do or obtain something; satisfying the appropriate conditions."},
        {"word": "eliminate", "definition": "To completely remove or get rid of something."},
        {"word": "eloquent", "definition": "Fluent or persuasive in speaking or writing."}
      ]
    },
    {
      "week_id": 15,
      "words_data": [
        {"word": "elusive", "definition": "Difficult to find, catch, or achieve."},
        {"word": "emancipate", "definition": "To set free, especially from legal, social, or political restrictions."},
        {"word": "embarrass", "definition": "To cause someone to feel awkward, self-conscious, or ashamed."},
        {"word": "embassy", "definition": "The official residence or offices of an ambassador."},
        {"word": "embody", "definition": "To be an expression of or give a tangible or visible form to an idea, quality, or feeling."},
        {"word": "embrace", "definition": "To hold someone closely in one's arms, especially as a sign of affection."},
        {"word": "emerge", "definition": "To move out of or away from something and come into view."},
        {"word": "emergency", "definition": "A serious, unexpected, and often dangerous situation requiring immediate action."},
        {"word": "eminent", "definition": "Famous and respected within a particular sphere or profession."},
        {"word": "emit", "definition": "To produce and discharge something, especially gas or radiation."},
        {"word": "emotion", "definition": "A strong feeling deriving from one's circumstances, mood, or relationships with others."},
        {"word": "emphasis", "definition": "Special importance, value, or prominence given to something."},
        {"word": "emphasize", "definition": "To give special importance or prominence to something in speaking or writing."},
        {"word": "empire", "definition": "An extensive group of states or countries under a single supreme authority."},
        {"word": "employ", "definition": "To give work to someone and pay them for it."},
        {"word": "empower", "definition": "To give someone the authority or power to do something."},
        {"word": "enable", "definition": "To give someone or something the authority or means to do something."},
        {"word": "enact", "definition": "To make a bill or other proposal law."},
        {"word": "enclose", "definition": "To surround or close off on all sides."},
        {"word": "encompass", "definition": "To surround and have or hold within."},
        {"word": "encounter", "definition": "To unexpectedly experience or be faced with something difficult or hostile."},
        {"word": "encourage", "definition": "To give support, confidence, or hope to someone."},
        {"word": "encroach", "definition": "To intrude on a person's territory or a right."},
        {"word": "encyclopedia", "definition": "A book or set of books giving information on many subjects or on many aspects of one subject and typically arranged alphabetically."},
        {"word": "endeavor", "definition": "An attempt to achieve a goal."},
        {"word": "endorse", "definition": "To declare one's public approval or support of."},
        {"word": "endure", "definition": "To suffer something painful or difficult patiently."},
        {"word": "energetic", "definition": "Showing or involving great vitality or activity."},
        {"word": "enforce", "definition": "To compel observance of or compliance with a law, rule, or obligation."},
        {"word": "engage", "definition": "To occupy, attract, or involve someone's interest or attention."},
        {"word": "engrave", "definition": "To cut or carve a text or design on the surface of a hard object."},
        {"word": "enhance", "definition": "To intensify, increase, or further improve the quality, value, or extent of."},
        {"word": "enigma", "definition": "A person or thing that is mysterious, puzzling, or difficult to understand."},
        {"word": "enormous", "definition": "Very large in size, quantity, or extent."},
        {"word": "enrich", "definition": "To improve or enhance the quality or value of."},
        {"word": "enroll", "definition": "To officially register as a member of an institution or a student on a course."},
        {"word": "ensue", "definition": "To happen or occur afterward or as a result."},
        {"word": "ensure", "definition": "To make certain that something shall occur or be the case."},
        {"word": "entail", "definition": "To involve something as a necessary or inevitable part or consequence."},
        {"word": "entertain", "definition": "To provide someone with amusement or enjoyment."}
      ]
    }
  ]
}