{
  "title": "Planning vocabulaire 2025-2026 - Anglais 8e année",
  "weeks_definitions": [
    {
      "week_id": 1,
      "words_data": [
        {"word": "accommodate", "definition": "To provide lodging or sufficient space for someone or something."},
        {"word": "analyze", "definition": "To examine something in detail to discover its meaning or structure."},
        {"word": "argument", "definition": "A reason or set of reasons given to persuade others, or an angry disagreement."},
        {"word": "bilingual", "definition": "Able to speak two languages fluently."},
        {"word": "committee", "definition": "A group of people appointed for a specific function or task."},
        {"word": "conscience", "definition": "An inner feeling or voice that guides you to know right from wrong."},
        {"word": "courageous", "definition": "Very brave; not deterred by danger or pain."},
        {"word": "criticism", "definition": "The expression of disapproval of someone or something based on perceived faults."},
        {"word": "descendant", "definition": "A person, plant, or animal that is descended from a particular ancestor."},
        {"word": "emergency", "definition": "A serious, unexpected, and often dangerous situation requiring immediate action."},
        {"word": "exaggerate", "definition": "To represent something as being larger, greater, better, or worse than it really is."},
        {"word": "fascinating", "definition": "Extremely interesting or captivating."},
        {"word": "guarantee", "definition": "A formal promise or assurance that certain conditions will be fulfilled."},
        {"word": "humorous", "definition": "Causing lighthearted laughter and amusement; funny."},
        {"word": "identity", "definition": "The fact of being who or what a person or thing is."},
        {"word": "illustrate", "definition": "To explain or make something clear by using examples, charts, or pictures."},
        {"word": "jewelry", "definition": "Personal ornaments, such as necklaces, rings, or bracelets."},
        {"word": "laboratory", "definition": "A room or building equipped for scientific experiments, research, or teaching."},
        {"word": "license", "definition": "An official document giving you permission to own, do, or use something."},
        {"word": "literature", "definition": "Written works, especially those considered to have artistic merit, like novels or poetry."},
        {"word": "mortgage", "definition": "A legal agreement in which a person borrows money to buy property, like a house."},
        {"word": "noticeable", "definition": "Easily seen or noticed; clear or apparent."},
        {"word": "occasion", "definition": "A particular time or instance of an event, often a special one."},
        {"word": "opponent", "definition": "Someone who competes against or fights another in a contest, game, or argument."},
        {"word": "permanent", "definition": "Lasting or intended to last or remain unchanged forever."},
        {"word": "persuade", "definition": "To convince someone to do or believe something through reasoning or argument."},
        {"word": "questionnaire", "definition": "A set of printed or written questions with a choice of answers, used for a survey."},
        {"word": "recommendation", "definition": "A suggestion or proposal as to the best course of action."},
        {"word": "restaurant", "definition": "A place where people pay to sit and eat meals that are cooked and served on the premises."},
        {"word": "rhythm", "definition": "A strong, regular, repeated pattern of movement or sound."},
        {"word": "secretary", "definition": "A person employed in an office to assist with correspondence and administrative tasks."},
        {"word": "significant", "definition": "Great or important enough to be worthy of attention."},
        {"word": "sophomore", "definition": "A student in the second year of high school or college."},
        {"word": "temperature", "definition": "The degree or intensity of heat present in a substance or object."},
        {"word": "tolerance", "definition": "The ability to accept behavior and beliefs that are different from your own."},
        {"word": "tournament", "definition": "A sporting competition in which contestants play a series of games to decide the winner."},
        {"word": "unanimous", "definition": "A decision or vote held or carried by everyone involved; fully in agreement."},
        {"word": "variety", "definition": "The quality or state of being different or diverse; a number of different things."},
        {"word": "vehicle", "definition": "A machine, usually with wheels and an engine, used for transporting people or goods."},
        {"word": "villain", "definition": "A character whose evil actions or motives are important to the plot of a story."}
      ]
    },
    {
      "week_id": 2,
      "words_data": [
        {"word": "abbreviate", "definition": "To shorten a word, phrase, or text."},
        {"word": "agriculture", "definition": "The science or practice of farming, including growing crops and raising animals."},
        {"word": "amateur", "definition": "A person who engages in a pursuit on an unpaid basis, rather than as a professional."},
        {"word": "catastrophe", "definition": "An event causing great and often sudden damage or suffering; a disaster."},
        {"word": "chromosome", "definition": "A structure found inside the nucleus of a cell that carries genetic information."},
        {"word": "circumference", "definition": "The enclosing boundary of a curved geometric figure, especially a circle."},
        {"word": "competition", "definition": "The activity or condition of competing against others."},
        {"word": "conjunction", "definition": "A word used to connect clauses or sentences, or to coordinate words in the same clause."},
        {"word": "development", "definition": "The process of developing or being developed; growth or progress."},
        {"word": "diagram", "definition": "A simplified drawing showing the appearance, structure, or workings of something."},
        {"word": "discipline", "definition": "The practice of training people to obey rules or a code of behavior."},
        {"word": "eclipse", "definition": "An obscuring of the light from one celestial body by the passage of another."},
        {"word": "encyclopedia", "definition": "A book or set of books giving information on many subjects or on many aspects of one subject."},
        {"word": "environment", "definition": "The surroundings or conditions in which a person, animal, or plant lives or operates."},
        {"word": "equivalent", "definition": "Equal in value, amount, function, or meaning."},
        {"word": "excursion", "definition": "A short journey or trip, especially one engaged in as a leisure activity."},
        {"word": "government", "definition": "The governing body of a nation, state, or community."},
        {"word": "governor", "definition": "The elected executive head of a state in the US."},
        {"word": "hazardous", "definition": "Risky or dangerous."},
        {"word": "hesitate", "definition": "To pause before saying or doing something, especially through uncertainty."},
        {"word": "immigrant", "definition": "A person who comes to live permanently in a foreign country."},
        {"word": "interval", "definition": "An intervening time or space; a pause or break in activity."},
        {"word": "jurisdiction", "definition": "The official power to make legal decisions and judgments."},
        {"word": "kindergarten", "definition": "A school or class that prepares children, usually five-year-olds, for first grade."},
        {"word": "magnificent", "definition": "Impressively beautiful, elaborate, or extravagant; striking."},
        {"word": "maintenance", "definition": "The process of maintaining or preserving someone or something, or the state of being maintained."},
        {"word": "manuscript", "definition": "A book, document, or piece of music written by hand rather than typed or printed."},
        {"word": "necessity", "definition": "The fact of being required or indispensable."},
        {"word": "orchestra", "definition": "A group of instrumentalists, especially one combining string, woodwind, brass, and percussion sections."},
        {"word": "pamphlet", "definition": "A small booklet or leaflet containing information or arguments about a single subject."},
        {"word": "physical", "definition": "Relating to the body as opposed to the mind."},
        {"word": "privilege", "definition": "A special right, advantage, or immunity granted or available only to a particular person or group."},
        {"word": "rectangle", "definition": "A plane figure with four straight sides and four right angles, especially one with unequal adjacent sides."},
        {"word": "rehearsal", "definition": "A practice or trial performance of a play or other work for later public performance."},
        {"word": "satellite", "definition": "An artificial body placed in orbit around the earth or moon or another planet in order to collect information or for communication."},
        {"word": "scrutiny", "definition": "Critical observation or examination."},
        {"word": "silhouette", "definition": "The dark shape and outline of someone or something visible against a lighter background."},
        {"word": "technique", "definition": "A way of carrying out a particular task, especially the execution or performance of an artistic work or a scientific procedure."},
        {"word": "veteran", "definition": "A person who has had long experience in a particular field, especially military service."},
        {"word": "warranty", "definition": "A written guarantee, issued to the purchaser of an article by its manufacturer, promising to repair or replace it if necessary."}
      ]
    },
    {
      "week_id": 3,
      "words_data": [
        {"word": "absorption", "definition": "The process or action by which one thing absorbs or is absorbed by another."},
        {"word": "accessory", "definition": "A thing which can be added to something else in order to make it more useful, versatile, or attractive."},
        {"word": "acoustics", "definition": "The properties or qualities of a room or building that determine how sound is transmitted in it."},
        {"word": "acquaintance", "definition": "A person's knowledge or experience of something, or a person one knows slightly."},
        {"word": "adolescence", "definition": "The period following the onset of puberty during which a young person develops from a child into an adult."},
        {"word": "affidavit", "definition": "A written statement confirmed by oath or affirmation, for use as evidence in court."},
        {"word": "alignment", "definition": "Arrangement in a straight line, or in correct or appropriate relative positions."},
        {"word": "antiseptic", "definition": "Relating to or denoting substances that prevent the growth of disease-causing microorganisms."},
        {"word": "apparatus", "definition": "The technical equipment or machinery needed for a particular activity or purpose."},
        {"word": "architecture", "definition": "The art or practice of designing and constructing buildings."},
        {"word": "assessment", "definition": "The evaluation or estimation of the nature, quality, or ability of someone or something."},
        {"word": "bankruptcy", "definition": "The state of being completely lacking in a particular quality or value, often related to being unable to pay outstanding debts."},
        {"word": "boulevard", "definition": "A wide street in a town or city, typically one lined with trees."},
        {"word": "bureaucracy", "definition": "A system of government in which most of the important decisions are made by state officials rather than by elected representatives."},
        {"word": "calculator", "definition": "Something used for making mathematical calculations, in particular a small electronic device with a keyboard and a visual display."},
        {"word": "candidate", "definition": "A person who applies for a job or is nominated for election."},
        {"word": "carnivore", "definition": "An animal that feeds on flesh."},
        {"word": "chrysalis", "definition": "A quiescent insect pupa, especially of a butterfly or moth."},
        {"word": "circumference", "definition": "The enclosing boundary of a curved geometric figure, especially a circle."},
        {"word": "coalition", "definition": "An alliance for combined action, especially a temporary alliance of political parties forming a government or of states."},
        {"word": "collateral", "definition": "Something pledged as security for repayment of a loan, to be forfeited in the event of a default."},
        {"word": "combustible", "definition": "Able to catch fire and burn easily."},
        {"word": "commentary", "definition": "An expression of opinions or offering of explanations about an event or situation."},
        {"word": "compassion", "definition": "Sympathetic pity and concern for the sufferings or misfortunes of others."},
        {"word": "compensation", "definition": "Something, typically money, awarded to someone as a recompense for loss, injury, or suffering."},
        {"word": "competitor", "definition": "A person who takes part in a sporting contest or a commercial entity engaging in the same business as another."},
        {"word": "concentration", "definition": "The action or power of focusing one's attention or mental effort."},
        {"word": "condominium", "definition": "A building or complex of buildings containing a number of individually owned apartments or houses."},
        {"word": "confirmation", "definition": "The action of confirming something or the state of being confirmed."},
        {"word": "consequence", "definition": "A result or effect of an action or condition."},
        {"word": "constitution", "definition": "A body of fundamental principles or established precedents according to which a state or other organization is acknowledged to be governed."},
        {"word": "contagious", "definition": "(Of a disease) spread from one person or organism to another by direct or indirect contact."},
        {"word": "corporation", "definition": "A company or group of people authorized to act as a single entity and recognized as such in law."},
        {"word": "counselor", "definition": "A person trained to give guidance on personal, social, or psychological problems."},
        {"word": "deficiency", "definition": "A lack or shortage of something."},
        {"word": "demolition", "definition": "The action or process of demolishing or being demolished, often a building."},
        {"word": "denominator", "definition": "The number below the line in a common fraction; a divisor."},
        {"word": "deposition", "definition": "The action of deposing someone, especially a monarch, or a formal, usually written, statement to be used as evidence."},
        {"word": "desolate", "definition": "(Of a place) deserted of people and in a state of bleak and dismal emptiness."}
      ]
    },{
      "week_id": 4,
      "words_data": [
        {"word": "deteriorate", "definition": "To become progressively worse."},
        {"word": "devastate", "definition": "To destroy or ruin completely."},
        {"word": "diaphragm", "definition": "A muscular partition separating the thorax from the abdomen."},
        {"word": "discrepancy", "definition": "An illogical or surprising lack of compatibility between facts."},
        {"word": "disposition", "definition": "A person's inherent qualities of mind and character."},
        {"word": "distinction", "definition": "A difference or contrast between similar things."},
        {"word": "efficiency", "definition": "The state or quality of being efficient; achieving maximum productivity."},
        {"word": "eligibility", "definition": "The state of having the right to do or obtain something."},
        {"word": "eloquent", "definition": "Fluent or persuasive in speaking or writing."},
        {"word": "emigration", "definition": "The act of leaving one's own country to settle permanently in another."},
        {"word": "emphasis", "definition": "Special importance, value, or prominence given to something."},
        {"word": "entrepreneur", "definition": "A person who organizes and operates a business, taking on financial risks."},
        {"word": "equilibrium", "definition": "A state in which opposing forces or influences are balanced."},
        {"word": "equivalent", "definition": "Equal in value, amount, function, or meaning."},
        {"word": "evacuation", "definition": "The action of evacuating a person or a place."},
        {"word": "exaggeration", "definition": "A statement that represents something as better or worse than it really is."},
        {"word": "exceptional", "definition": "Unusually good; outstanding."},
        {"word": "executive", "definition": "Having the power to put plans, actions, or laws into effect."},
        {"word": "exhibition", "definition": "A public display of works of art or items of interest."},
        {"word": "expectancy", "definition": "The state of thinking or hoping that something will happen."},
        {"word": "extravagant", "definition": "Lacking restraint in spending money or using resources."},
        {"word": "extremist", "definition": "A person who holds extreme political or religious views."},
        {"word": "fabrication", "definition": "The action or process of manufacturing or inventing something false."},
        {"word": "familiarity", "definition": "Close acquaintance with or knowledge of something."},
        {"word": "fermentation", "definition": "The chemical breakdown of a substance by bacteria, yeasts, or other microorganisms."},
        {"word": "fluorescent", "definition": "Having or showing fluorescence; vividly colorful."},
        {"word": "formation", "definition": "The action of forming or process of being formed."},
        {"word": "formidable", "definition": "Inspiring fear or respect through being impressively large or powerful."},
        {"word": "founder", "definition": "A person who establishes an institution or settlement."},
        {"word": "galaxy", "definition": "A system of millions or billions of stars, together with gas and dust."},
        {"word": "generator", "definition": "A machine for converting mechanical energy into electricity."},
        {"word": "gladiator", "definition": "A man trained to fight with weapons against other men or wild animals in ancient Rome."},
        {"word": "grandeur", "definition": "Splendor and impressiveness, especially of appearance or style."},
        {"word": "grievance", "definition": "A real or imagined wrong or other cause for complaint or protest."},
        {"word": "hereditary", "definition": "Conferred by or based on inheritance."},
        {"word": "hierarchy", "definition": "A system in which people or groups are ranked according to status or authority."},
        {"word": "homogeneous", "definition": "Of the same kind; alike."},
        {"word": "hydrogen", "definition": "A colorless, odorless, highly flammable gas, the chemical element of atomic number 1."},
        {"word": "hypocrisy", "definition": "The practice of claiming to have moral standards to which one's own behavior does not conform."},
        {"word": "hypothesis", "definition": "A supposition or proposed explanation made on the basis of limited evidence."}
      ]
    },
    {
      "week_id": 5,
      "words_data": [
        {"word": "illuminate", "definition": "To light up or clarify."},
        {"word": "illustration", "definition": "A picture illustrating a book, newspaper, or magazine."},
        {"word": "imagery", "definition": "Visually descriptive or figurative language."},
        {"word": "imitation", "definition": "The action of using someone or something as a model."},
        {"word": "immigrant", "definition": "A person who comes to live permanently in a foreign country."},
        {"word": "impartial", "definition": "Treating all rivals or disputants equally; fair and just."},
        {"word": "implement", "definition": "To put into effect; a tool or piece of equipment."},
        {"word": "implication", "definition": "The conclusion that can be drawn from something, although it is not explicitly stated."},
        {"word": "impression", "definition": "An idea, feeling, or opinion about something or someone."},
        {"word": "inanimate", "definition": "Not alive, especially not in the manner of animals and humans."},
        {"word": "inauguration", "definition": "The formal admission of someone to office."},
        {"word": "incentive", "definition": "A thing that motivates or encourages one to do something."},
        {"word": "incidence", "definition": "The occurrence, rate, or frequency of a disease, crime, or something else undesirable."},
        {"word": "indefinite", "definition": "Lasting for an unknown or unstated length of time."},
        {"word": "indictment", "definition": "A formal charge or accusation of a serious crime."},
        {"word": "indigenous", "definition": "Originating or occurring naturally in a particular place; native."},
        {"word": "inducement", "definition": "A thing that persuades or influences someone to do something."},
        {"word": "inevitable", "definition": "Certain to happen; unavoidable."},
        {"word": "infantry", "definition": "Soldiers marching or fighting on foot."},
        {"word": "inflammation", "definition": "A localized physical condition in which part of the body becomes reddened, swollen, hot, and often painful."},
        {"word": "influential", "definition": "Having great influence on someone or something."},
        {"word": "ingenious", "definition": "Clever, original, and inventive."},
        {"word": "ingredient", "definition": "Any of the foods or substances that are combined to make a particular dish."},
        {"word": "inhabitant", "definition": "A person or animal that lives in or occupies a place."},
        {"word": "inheritance", "definition": "A thing that is inherited."},
        {"word": "innocence", "definition": "The state, quality, or fact of being innocent of a crime or offense."},
        {"word": "innovation", "definition": "The action or process of innovating; a new method, idea, or product."},
        {"word": "inoculation", "definition": "The action of immunizing someone against a disease; vaccination."},
        {"word": "inscription", "definition": "Words inscribed, as on a monument or in a book."},
        {"word": "insomnia", "definition": "Habitual sleeplessness; inability to sleep."},
        {"word": "inspection", "definition": "Careful examination or scrutiny."},
        {"word": "instinctive", "definition": "Relating to or prompted by instinct; apparently unconscious or automatic."},
        {"word": "institute", "definition": "A society or organization having a particular object or common factor."},
        {"word": "insurance", "definition": "A practice or arrangement by which a company provides a guarantee of compensation for specified loss."},
        {"word": "integrity", "definition": "The quality of being honest and having strong moral principles."},
        {"word": "intellectual", "definition": "Relating to the intellect; a person possessing a highly developed intellect."},
        {"word": "intelligence", "definition": "The ability to acquire and apply knowledge and skills."},
        {"word": "intensive", "definition": "Concentrated on a single area or subject or into a short time."},
        {"word": "interference", "definition": "The action of interfering or the process of being interfered with."},
        {"word": "intermediate", "definition": "Coming between two things in time, place, order, character, etc."}
      ]
    },
    {
      "week_id": 6,
      "words_data": [
        {"word": "interpretation", "definition": "The action of explaining the meaning of something."},
        {"word": "interrogate", "definition": "To ask questions of someone closely, aggressively, or formally."},
        {"word": "intervene", "definition": "To come between so as to prevent or alter a result or course of events."},
        {"word": "intricate", "definition": "Very complicated or detailed."},
        {"word": "introduction", "definition": "The action of introducing something."},
        {"word": "intuition", "definition": "The ability to understand something immediately, without the need for conscious reasoning."},
        {"word": "invaluable", "definition": "Extremely useful; indispensable."},
        {"word": "inventory", "definition": "A complete list of items such as property, goods in stock, or the contents of a building."},
        {"word": "investigator", "definition": "A person who carries out a formal inquiry or investigation."},
        {"word": "investment", "definition": "The action or process of investing money for profit or material result."},
        {"word": "invitation", "definition": "A written or verbal request inviting someone to go somewhere or to do something."},
        {"word": "involuntary", "definition": "Done without will or conscious control."},
        {"word": "irrational", "definition": "Not logical or reasonable."},
        {"word": "irrigation", "definition": "The supply of water to land or crops to help growth, typically by means of channels."},
        {"word": "jeopardize", "definition": "To put into a situation in which there is a danger of loss, harm, or failure."},
        {"word": "judicial", "definition": "Of, by, or appropriate to a court or judge."},
        {"word": "justification", "definition": "The action of showing something to be right or reasonable."},
        {"word": "kindergarten", "definition": "A school or class for young children."},
        {"word": "laboratory", "definition": "A room or building equipped for scientific experiments."},
        {"word": "landscape", "definition": "All the visible features of an area of countryside or land."},
        {"word": "legislature", "definition": "The legislative body of a country or state."},
        {"word": "legitimate", "definition": "Conforming to the law or to rules."},
        {"word": "liability", "definition": "The state of being responsible for something, especially by law."},
        {"word": "lieutenant", "definition": "A deputy or substitute acting for a superior; a military rank."},
        {"word": "likelihood", "definition": "The state or fact of something's being likely; probability."},
        {"word": "limitation", "definition": "A limiting rule or circumstance; a restriction."},
        {"word": "literature", "definition": "Written works, especially those considered of superior or lasting artistic merit."},
        {"word": "livelihood", "definition": "A means of securing the necessities of life."},
        {"word": "location", "definition": "A particular place or position."},
        {"word": "longitude", "definition": "The angular distance of a place east or west of the meridian at Greenwich."},
        {"word": "lucrative", "definition": "Producing a great deal of profit."},
        {"word": "magnificent", "definition": "Impressively beautiful, elaborate, or extravagant."},
        {"word": "maintenance", "definition": "The process of maintaining or preserving someone or something."},
        {"word": "malicious", "definition": "Characterized by malice; intending or intended to do harm."},
        {"word": "malnutrition", "definition": "Lack of proper nutrition."},
        {"word": "manageable", "definition": "Able to be managed, controlled, or accomplished without great difficulty."},
        {"word": "manifest", "definition": "Clear or obvious to the eye or mind."},
        {"word": "manufacture", "definition": "To make something on a large scale using machinery."},
        {"word": "manuscript", "definition": "A book, document, or piece of music written by hand."},
        {"word": "maritime", "definition": "Connected with the sea, especially in relation to seafaring commercial or military activity."}
      ]
    },
    {
      "week_id": 7,
      "words_data": [
        {"word": "melancholy", "definition": "A feeling of pensive sadness, typically with no obvious cause."},
        {"word": "memorandum", "definition": "A written message in business or diplomacy."},
        {"word": "merchandise", "definition": "Goods to be bought and sold."},
        {"word": "metabolism", "definition": "The chemical processes that occur within a living organism in order to maintain life."},
        {"word": "metropolitan", "definition": "Relating to or denoting a metropolis, often inclusive of its surrounding areas."},
        {"word": "migration", "definition": "Seasonal movement of animals or people from one region to another."},
        {"word": "miniature", "definition": "A thing that is much smaller than normal, especially a small replica or model."},
        {"word": "minority", "definition": "The smaller number or part, especially a number that is less than half the whole number."},
        {"word": "miscellaneous", "definition": "Of various types or from different sources."},
        {"word": "mischievous", "definition": "Causing or showing a fondness for causing trouble in a playful way."},
        {"word": "misconception", "definition": "A view or opinion that is incorrect because based on faulty thinking or understanding."},
        {"word": "misfortune", "definition": "Bad luck; an unfortunate condition or event."},
        {"word": "monarchy", "definition": "A form of government with a monarch at the head."},
        {"word": "mortgage", "definition": "A legal agreement by which a bank lends money in exchange for taking title of the debtor's property."},
        {"word": "municipal", "definition": "Relating to a city or town or its governing body."},
        {"word": "narrative", "definition": "A spoken or written account of connected events; a story."},
        {"word": "nationalist", "definition": "A person who strongly identifies with their own nation and vigorously supports its interests."},
        {"word": "navigation", "definition": "The process or activity of accurately ascertaining one's position and planning and following a route."},
        {"word": "necessity", "definition": "The fact of being required or indispensable."},
        {"word": "negligence", "definition": "Failure to take proper care in doing something."},
        {"word": "negotiate", "definition": "To obtain or bring about by discussion."},
        {"word": "neutron", "definition": "A subatomic particle of about the same mass as a proton but without an electric charge."},
        {"word": "nominee", "definition": "A person who is proposed or formally entered as a candidate for an office."},
        {"word": "nostalgia", "definition": "A sentimental longing or wistful affection for the past."},
        {"word": "notorious", "definition": "Famous or well known, typically for some bad quality or deed."},
        {"word": "nuisance", "definition": "A person, thing, or circumstance causing inconvenience or annoyance."},
        {"word": "numerical", "definition": "Relating to or expressed as a number or numbers."},
        {"word": "nutrition", "definition": "The process of providing or obtaining the food necessary for health and growth."},
        {"word": "obligation", "definition": "An act or course of action to which a person is morally or legally bound; a duty."},
        {"word": "obsolescence", "definition": "The process of becoming obsolete or outdated and no longer used."},
        {"word": "obstacle", "definition": "A thing that blocks one's way or prevents or hinders progress."},
        {"word": "occupation", "definition": "A job or profession; the action of occupying a place."},
        {"word": "occurrence", "definition": "An incident or event."},
        {"word": "offensive", "definition": "Causing someone to feel deeply hurt, upset, or angry; actively aggressive."},
        {"word": "omission", "definition": "Someone or something that has been left out or excluded."},
        {"word": "opinionated", "definition": "Conceitedly assertive and dogmatic in one's opinions."},
        {"word": "opponent", "definition": "Someone who competes against or fights another in a contest, game, or argument."},
        {"word": "opportunity", "definition": "A set of circumstances that makes it possible to do something."},
        {"word": "oppression", "definition": "Prolonged cruel or unjust treatment or control."},
        {"word": "optimism", "definition": "Hopefulness and confidence about the future or the successful outcome of something."}
      ]
    },
    {
      "week_id": 8,
      "words_data": [
        {"word": "organism", "definition": "An individual animal, plant, or single-celled life form."},
        {"word": "orientation", "definition": "The determination of the relative position of something or someone."},
        {"word": "original", "definition": "Present or existing from the beginning; first or earliest."},
        {"word": "outrageous", "definition": "Shockingly bad or excessive."},
        {"word": "overestimate", "definition": "To form too high or favorable an estimate of."},
        {"word": "pamphlet", "definition": "A small booklet or leaflet containing information or arguments about a single subject."},
        {"word": "panorama", "definition": "An unbroken view of the whole region surrounding an observer."},
        {"word": "paradox", "definition": "A seemingly absurd or self-contradictory statement that may prove to be well founded or true."},
        {"word": "parenthesis", "definition": "A word, clause, or sentence inserted as an explanation or afterthought."},
        {"word": "participant", "definition": "A person who takes part in something."},
        {"word": "penetrate", "definition": "To succeed in forcing a way into or through."},
        {"word": "perception", "definition": "The ability to see, hear, or become aware of something through the senses."},
        {"word": "percussion", "definition": "Musical instruments played by striking with the hand or with a handheld or pedal-operated stick or beater."},
        {"word": "perennial", "definition": "Lasting or existing for a long or apparently infinite time."},
        {"word": "performance", "definition": "An act of staging or presenting a play, concert, or other form of entertainment."},
        {"word": "permanent", "definition": "Lasting or intended to last or remain unchanged forever."},
        {"word": "permissible", "definition": "Permitted; allowed."},
        {"word": "persistence", "definition": "Firm or obstinate continuance in a course of action in spite of difficulty or opposition."},
        {"word": "perspective", "definition": "A particular attitude toward or way of regarding something; a point of view."},
        {"word": "persuasion", "definition": "The action or fact of persuading someone or of being persuaded to do or believe something."},
        {"word": "pertinent", "definition": "Relevant or applicable to a particular matter."},
        {"word": "phenomenon", "definition": "A fact or situation that is observed to exist or happen, especially one whose cause is in question."},
        {"word": "philosophy", "definition": "The study of the fundamental nature of knowledge, reality, and existence."},
        {"word": "photosynthesis", "definition": "The process by which green plants and some other organisms use sunlight to synthesize foods."},
        {"word": "pioneer", "definition": "A person who is among the first to explore or settle a new country or area."},
        {"word": "portfolio", "definition": "A large, thin, flat case for loose sheets of paper such as drawings or maps; a range of investments."},
        {"word": "posthumous", "definition": "Occurring, awarded, or appearing after the death of the originator."},
        {"word": "potential", "definition": "Having or showing the capacity to become or develop into something in the future."},
        {"word": "precaution", "definition": "A measure taken in advance to prevent something dangerous, unpleasant, or inconvenient from happening."},
        {"word": "precedent", "definition": "An earlier event or action that is regarded as an example or guide to be considered in subsequent similar circumstances."},
        {"word": "precision", "definition": "The quality, condition, or fact of being exact and accurate."},
        {"word": "predominant", "definition": "Present as the strongest or main element."},
        {"word": "preliminary", "definition": "Denoting an action or event preceding or doing in preparation for something fuller or more important."},
        {"word": "preposition", "definition": "A word governing, and usually preceding, a noun or pronoun and expressing a relation to another word."},
        {"word": "prestigious", "definition": "Inspiring respect and admiration; having high status."},
        {"word": "priority", "definition": "The fact or condition of being regarded or treated as more important."},
        {"word": "probability", "definition": "The extent to which something is probable; the likelihood of something happening."},
        {"word": "procedure", "definition": "An established or official way of doing something."},
        {"word": "proclamation", "definition": "A public or official announcement, especially one dealing with a matter of great importance."},
        {"word": "profession", "definition": "A paid occupation, especially one that involves prolonged training and a formal qualification."}
      ]
    },
    {
      "week_id": 9,
      "words_data": [
        {"word": "proficiency", "definition": "A high degree of competence or skill; expertise."},
        {"word": "prohibition", "definition": "The action of forbidding something, especially by law."},
        {"word": "projection", "definition": "An estimate or forecast of a future situation based on a study of present trends."},
        {"word": "prominent", "definition": "Important; famous; projecting from something."},
        {"word": "propaganda", "definition": "Information, especially of a biased or misleading nature, used to promote a political cause or point of view."},
        {"word": "proposition", "definition": "A statement or assertion that expresses a judgment or opinion."},
        {"word": "prosperity", "definition": "The state of being prosperous; financial success."},
        {"word": "protective", "definition": "Having or showing a strong wish to keep someone or something safe from harm."},
        {"word": "protocol", "definition": "The official procedure or system of rules governing affairs of state or diplomatic occasions."},
        {"word": "provision", "definition": "The action of providing or supplying something for use."},
        {"word": "proximity", "definition": "Nearness in space, time, or relationship."},
        {"word": "psychology", "definition": "The scientific study of the human mind and its functions."},
        {"word": "publication", "definition": "The preparation and issuing of a book, journal, piece of music, or other work for public sale."},
        {"word": "puncture", "definition": "A small hole in a tire resulting in an escape of air."},
        {"word": "qualification", "definition": "A quality or accomplishment that makes someone suitable for a particular job or activity."},
        {"word": "quarantine", "definition": "A state, period, or place of isolation in which people or animals that have arrived from elsewhere or been exposed to infectious or contagious disease are placed."},
        {"word": "quivering", "definition": "Trembling or shaking with a slight rapid motion."},
        {"word": "radiation", "definition": "The emission of energy as electromagnetic waves or as moving subatomic particles."},
        {"word": "realistic", "definition": "Having or showing a sensible and practical idea of what can be achieved or expected."},
        {"word": "reassure", "definition": "Say or do something to remove the doubts and fears of someone."},
        {"word": "rebellion", "definition": "An act of violent or open resistance to an established government or ruler."},
        {"word": "receipt", "definition": "A written or printed statement acknowledging that something has been paid for or that goods have been received."},
        {"word": "recede", "definition": "Go or move back or further away from a previous position."},
        {"word": "reciprocal", "definition": "Given, felt, or done in return."},
        {"word": "recognition", "definition": "The action or process of recognizing or being recognized, in particular."},
        {"word": "recommendation", "definition": "A suggestion or proposal as to the best course of action, especially one put forward by an authoritative body."},
        {"word": "recuperate", "definition": "Recover from illness or exertion."},
        {"word": "referendum", "definition": "A general vote by the electorate on a single political question that has been referred to them for a direct decision."},
        {"word": "reflection", "definition": "The throwing back by a body or surface of light, heat, or sound without absorbing it."},
        {"word": "refractory", "definition": "Stubborn or unmanageable."},
        {"word": "regardless", "definition": "Without paying attention to the present situation; despite the prevailing circumstances."},
        {"word": "registrar", "definition": "An official responsible for keeping a register or official records."},
        {"word": "regulation", "definition": "A rule or directive made and maintained by an authority."},
        {"word": "reinforce", "definition": "Strengthen or support, especially with additional personnel or material."},
        {"word": "relevant", "definition": "Closely connected or appropriate to the matter at hand."},
        {"word": "reluctant", "definition": "Unwilling and hesitant; disinclined."},
        {"word": "remembrance", "definition": "The action of remembering something."},
        {"word": "renaissance", "definition": "A revival of or renewed interest in something; the revival of art and literature under the influence of classical models in the 14th-16th centuries."},
        {"word": "renovation", "definition": "The action of renovating a building."},
        {"word": "repetition", "definition": "The action of repeating something that has already been said or written."}
      ]
    },
    {
      "week_id": 10,
      "words_data": [
        {"word": "representative", "definition": "Typical of a class, group, or body of opinion; a person chosen to act or speak for others."},
        {"word": "reservoir", "definition": "A large natural or artificial lake used as a source of water supply."},
        {"word": "resistance", "definition": "The refusal to accept or comply with something; the attempt to prevent something by action or argument."},
        {"word": "resolution", "definition": "A firm decision to do or not to do something."},
        {"word": "respiration", "definition": "The action of breathing."},
        {"word": "responsibility", "definition": "The state or fact of having a duty to deal with something or of having control over someone."},
        {"word": "restriction", "definition": "A limiting condition or measure, especially a legal one."},
        {"word": "retaliate", "definition": "Make an attack or assault in return for a similar attack."},
        {"word": "retrieval", "definition": "The process of getting something back from somewhere."},
        {"word": "revelation", "definition": "A surprising and previously unknown fact, especially one that is made known in a dramatic way."},
        {"word": "reverence", "definition": "Deep respect for someone or something."},
        {"word": "revision", "definition": "The action of revising."},
        {"word": "rhetoric", "definition": "The art of effective or persuasive speaking or writing."},
        {"word": "rigorous", "definition": "Extremely thorough, exhaustive, or accurate."},
        {"word": "roulette", "definition": "A gambling game in which a ball is dropped onto a revolving wheel with numbered compartments."},
        {"word": "sanitary", "definition": "Relating to the conditions that affect hygiene and health, especially the supply of sewage facilities and clean drinking water."},
        {"word": "saturate", "definition": "Cause something to become thoroughly soaked with liquid so that no more can be absorbed."},
        {"word": "scandalous", "definition": "Causing general public outrage by a perceived offense against morality or law."},
        {"word": "schedule", "definition": "A plan for carrying out a process or procedure, giving lists of intended events and times."},
        {"word": "schematic", "definition": "Symbolic and simplified."},
        {"word": "scholarship", "definition": "Academic study or achievement; learning of a high level; a grant or payment made to support a student's education."},
        {"word": "scientific", "definition": "Based on or characterized by the methods and principles of science."},
        {"word": "scrutiny", "definition": "Critical observation or examination."},
        {"word": "secretary", "definition": "A person employed by an individual or in an office to assist with correspondence, keep records, make appointments, and carry out similar tasks."},
        {"word": "sediment", "definition": "Matter that settles to the bottom of a liquid; dregs."},
        {"word": "segregation", "definition": "The action or state of setting someone or something apart from other people or things or being set apart."},
        {"word": "sensation", "definition": "A physical feeling or perception resulting from something that happens to or comes into contact with the body."},
        {"word": "sequence", "definition": "A particular order in which related events, movements, or things follow each other."},
        {"word": "sergeant", "definition": "A noncommissioned officer in the armed forces or police."},
        {"word": "significant", "definition": "Sufficiently great or important to be worthy of attention; noteworthy."},
        {"word": "silhouette", "definition": "The dark shape and outline of someone or something visible against a lighter background, especially in dim light."},
        {"word": "similarity", "definition": "The state or fact of being similar."},
        {"word": "simile", "definition": "A figure of speech involving the comparison of one thing with another thing of a different kind."},
        {"word": "simultaneous", "definition": "Occurring, operating, or done at the same time."},
        {"word": "skeptical", "definition": "Not easily convinced; having doubts or reservations."},
        {"word": "soliloquy", "definition": "An act of speaking one's thoughts aloud when by oneself or regardless of any hearers, especially by a character in a play."},
        {"word": "souvenir", "definition": "A thing that is kept as a reminder of a person, place, or event."},
        {"word": "sovereign", "definition": "A supreme ruler, especially a monarch."},
        {"word": "spectator", "definition": "A person who watches at a show, game, or other event."},
        {"word": "spontaneous", "definition": "Performed or occurring as a result of a sudden inner impulse or inclination and without premeditation or external stimulus."}
      ]
    },
    {
      "week_id": 11,
      "words_data": [
        {"word": "stabilization", "definition": "The process of making something physically more secure or stable."},
        {"word": "stagnant", "definition": "Showing no activity; dull and sluggish; (of a body of water) having no current or flow and often having an unpleasant smell as a consequence."},
        {"word": "statistic", "definition": "A fact or piece of data from a study of a large quantity of numerical data."},
        {"word": "stereotype", "definition": "A widely held but fixed and oversimplified image or idea of a particular type of person or thing."},
        {"word": "stimulus", "definition": "A thing or event that evokes a specific functional reaction in an organ or tissue."},
        {"word": "strategic", "definition": "Relating to the identification of long-term or overall aims and interests and the means of achieving them."},
        {"word": "submission", "definition": "The action or fact of accepting or yielding to a superior force or to the will or authority of another person."},
        {"word": "subordinate", "definition": "Lower in rank or position."},
        {"word": "subsequent", "definition": "Coming after something in time; following."},
        {"word": "substance", "definition": "A particular kind of matter with uniform properties."},
        {"word": "substantial", "definition": "Of considerable importance, size, or worth."},
        {"word": "suburban", "definition": "Of or characteristic of a suburb."},
        {"word": "sufficient", "definition": "Enough; adequate."},
        {"word": "suffrage", "definition": "The right to vote in political elections."},
        {"word": "summation", "definition": "The process of adding things together."},
        {"word": "superintendent", "definition": "A person who manages or superintends an organization or activity."},
        {"word": "supersede", "definition": "Take the place of (a person or thing previously in authority or use); supplant."},
        {"word": "supplement", "definition": "Something that completes or enhances something else when added to it."},
        {"word": "suppress", "definition": "Forcibly put an end to."},
        {"word": "surrogate", "definition": "A substitute, especially a person deputizing for another in a specific role or office."},
        {"word": "surveillance", "definition": "Close observation, especially of a suspected spy or criminal."},
        {"word": "suspension", "definition": "The temporary prevention of something from continuing or being in force or effect."},
        {"word": "suspicion", "definition": "A feeling or thought that something is possible, likely, or true."},
        {"word": "syllable", "definition": "A unit of pronunciation having one vowel sound, with or without surrounding consonants, forming the whole or a part of a word."},
        {"word": "symmetrical", "definition": "Made up of exactly similar parts facing each other or around an axis; showing symmetry."},
        {"word": "symposium", "definition": "A conference or meeting to discuss a particular subject."},
        {"word": "syndrome", "definition": "A group of symptoms which consistently occur together, or a condition characterized by a set of associated symptoms."},
        {"word": "synthesis", "definition": "The combination of ideas to form a theory or system."},
        {"word": "systematic", "definition": "Done or acting according to a fixed plan or system; methodical."},
        {"word": "technical", "definition": "Relating to a particular subject, art, or craft, or its techniques."},
        {"word": "technology", "definition": "The application of scientific knowledge for practical purposes, especially in industry."},
        {"word": "temperament", "definition": "A person's or animal's nature, especially as it permanently affects their behavior."},
        {"word": "temporary", "definition": "Lasting for only a limited period of time; not permanent."},
        {"word": "tendency", "definition": "An inclination toward a particular characteristic or type of behavior."},
        {"word": "tentative", "definition": "Not certain or fixed; provisional."},
        {"word": "terminate", "definition": "Bring to an end."},
        {"word": "terrain", "definition": "A stretch of land, especially with regard to its physical features."},
        {"word": "territory", "definition": "An area of land under the jurisdiction of a ruler or state."},
        {"word": "testimony", "definition": "A formal written or spoken statement, especially one given in a court of law."},
        {"word": "therapeutic", "definition": "Relating to the healing of disease."}
      ]
    },
    {
      "week_id": 12,
      "words_data": [
        {"word": "threshold", "definition": "A strip of wood, metal, or stone forming the bottom of a doorway and crossed in entering a house or room; a starting point."},
        {"word": "tolerance", "definition": "The ability or willingness to tolerate something, in particular the existence of opinions or behavior that one does not necessarily agree with."},
        {"word": "topographical", "definition": "Relating to the arrangement of the physical features of an area."},
        {"word": "tournament", "definition": "A sporting competition in which contestants play a series of games to decide the winner."},
        {"word": "tradition", "definition": "The transmission of customs or beliefs from generation to generation, or the fact of being passed on in this way."},
        {"word": "trajectory", "definition": "The path followed by a projectile flying or an object moving under the action of given forces."},
        {"word": "transcend", "definition": "Be or go beyond the range or limits of (something abstract, typically a conceptual field or division)."},
        {"word": "transition", "definition": "The process or a period of changing from one state or condition to another."},
        {"word": "transmission", "definition": "The action or process of transmitting something or the state of being transmitted."},
        {"word": "transparent", "definition": "Allowing light to pass through so that objects behind can be distinctly seen."},
        {"word": "treasurer", "definition": "A person appointed to administer or manage the financial assets and liabilities of a society, company, local authority, or other body."},
        {"word": "tremendous", "definition": "Very great in amount, scale, or intensity."},
        {"word": "tribunal", "definition": "A court of justice."},
        {"word": "trilogy", "definition": "A group of three related novels, plays, films, operas, or albums."},
        {"word": "triumphant", "definition": "Having won a battle or contest; victorious."},
        {"word": "trivial", "definition": "Of little value or importance."},
        {"word": "turbulence", "definition": "Violent or unsteady movement of air or water, or of some other fluid."},
        {"word": "ultraviolet", "definition": "Having a wavelength shorter than that of the violet end of the visible spectrum but longer than that of X-rays."},
        {"word": "unanimous", "definition": "Fully in agreement."},
        {"word": "unconscious", "definition": "Not conscious."},
        {"word": "underlie", "definition": "Be a significant cause or basis of something if not necessarily manifest or obvious."},
        {"word": "undermine", "definition": "Erode the base or foundation of (a rock formation); damage or weaken (someone or something), especially gradually or insidiously."},
        {"word": "undertake", "definition": "Commit oneself to and begin (an enterprise or responsibility); take on."},
        {"word": "uniform", "definition": "Not changing in form or character; remaining the same in all cases and at all times."},
        {"word": "unilateral", "definition": "Performed by or affecting only one person, group, or country involved in a particular situation, without the agreement of another or the others."},
        {"word": "universal", "definition": "Of, affecting, or done by all people or things in the world or in a particular group; applicable to all cases."},
        {"word": "unprecedented", "definition": "Never done or known before."},
        {"word": "unravel", "definition": "Undo (twisted, knitted, or woven threads)."},
        {"word": "utilitarian", "definition": "Designed to be useful or practical rather than attractive."},
        {"word": "utterance", "definition": "A spoken word, statement, or vocal sound."},
        {"word": "vacancy", "definition": "An unoccupied position or job."},
        {"word": "vaccination", "definition": "Treatment with a vaccine to produce immunity against a disease; inoculation."},
        {"word": "vacuum", "definition": "A space entirely devoid of matter."},
        {"word": "validate", "definition": "Check or prove the validity or accuracy of (something)."},
        {"word": "valuation", "definition": "An estimation of something's worth, especially one carried out by a professional appraiser."},
        {"word": "variable", "definition": "Not consistent or having a fixed pattern; liable to change."},
        {"word": "variation", "definition": "A change or difference in condition, amount, or level, typically with certain limits."},
        {"word": "vegetation", "definition": "Plants considered collectively, especially those found in a particular area or habitat."},
        {"word": "velocity", "definition": "The speed of something in a given direction."},
        {"word": "ventilate", "definition": "Cause air to enter and circulate freely in (a room, building, etc.)."}
      ]
    },
    {
      "week_id": 13,
      "words_data": [
        {"word": "verbal", "definition": "Relating to or in the form of words."},
        {"word": "verify", "definition": "Make sure or demonstrate that something is true, accurate, or justified."},
        {"word": "versatile", "definition": "Able to adapt or be adapted to many different functions or activities."},
        {"word": "vertical", "definition": "At right angles to a horizontal plane; in a direction, or having an alignment, such that the top is directly above the bottom."},
        {"word": "veteran", "definition": "A person who has had long experience in a particular field."},
        {"word": "veto", "definition": "A constitutional right to reject a decision or proposal made by a law-making body."},
        {"word": "vicinity", "definition": "The area near or surrounding a particular place."},
        {"word": "victim", "definition": "A person harmed, injured, or killed as a result of a crime, accident, or other event or action."},
        {"word": "viewpoint", "definition": "A person's opinion or point of view."},
        {"word": "vigorous", "definition": "Strong, healthy, and full of energy."},
        {"word": "violation", "definition": "The action of violating someone or something."},
        {"word": "virtual", "definition": "Almost or nearly as described, but not completely or according to strict definition; generated by a computer."},
        {"word": "visible", "definition": "Able to be seen."},
        {"word": "visual", "definition": "Relating to seeing or sight."},
        {"word": "vitality", "definition": "The state of being strong and active; energy."},
        {"word": "vocalize", "definition": "Utter (a sound or word)."},
        {"word": "vocation", "definition": "A strong feeling of suitability for a particular career or occupation."},
        {"word": "volatile", "definition": "Liable to change rapidly and unpredictably, especially for the worse."},
        {"word": "volume", "definition": "The amount of space that a substance or object occupies, or that is enclosed within a container."},
        {"word": "voluntary", "definition": "Done, given, or acting of one's own free will."},
        {"word": "vulnerable", "definition": "Susceptible to physical or emotional attack or harm."},
        {"word": "warranty", "definition": "A written guarantee, issued to the purchaser of an article by its manufacturer, promising to repair or replace it if necessary within a specified period of time."},
        {"word": "wasteful", "definition": "Using or expending something of value carelessly, extravagantly, or to no purpose."},
        {"word": "welfare", "definition": "The health, happiness, and fortunes of a person or group."},
        {"word": "whereas", "definition": "In contrast or comparison with the fact that."},
        {"word": "wholesale", "definition": "The selling of goods in large quantities to be retailed by others."},
        {"word": "wilderness", "definition": "An uncultivated, uninhabited, and inhospitable region."},
        {"word": "withdrawal", "definition": "The action of withdrawing something."},
        {"word": "witness", "definition": "A person who sees an event, typically a crime or accident, take place."},
        {"word": "withhold", "definition": "Refuse to give (something that is due to or is desired by another)."},
        {"word": "withstand", "definition": "Remain undamaged or unaffected by; resist."},
        {"word": "worship", "definition": "The feeling or expression of reverence and adoration for a deity."},
        {"word": "worthless", "definition": "Having no real value or use."},
        {"word": "wrathful", "definition": "Full of or characterized by intense anger."},
        {"word": "wretched", "definition": "In a very unhappy or unfortunate state."},
        {"word": "writhing", "definition": "Making twisting, squirming movements or contortions of the body."},
        {"word": "yield", "definition": "Produce or provide (a natural, agricultural, or industrial product)."},
        {"word": "zealous", "definition": "Having or showing zeal; passionate and dedicated."},
        {"word": "zenith", "definition": "The time at which something is most powerful or successful."},
        {"word": "zoology", "definition": "The scientific study of the behavior, structure, physiology, classification, and distribution of animals."}
      ]
    },
    {
      "week_id": 14,
      "words_data": [
        {"word": "aberration", "definition": "A departure from what is normal, usual, or expected, typically one that is unwelcome."},
        {"word": "abstinence", "definition": "The fact or practice of restraining oneself from indulging in something, typically alcohol."},
        {"word": "accelerator", "definition": "A person or thing that causes something to happen or develop more quickly."},
        {"word": "accessory", "definition": "A thing which can be added to something else in order to make it more useful, versatile, or attractive."},
        {"word": "acclimatize", "definition": "Respond to a new climate or situation; adapt."},
        {"word": "accreditation", "definition": "The action or process of officially recognizing someone as having a particular status or being qualified to perform a particular activity."},
        {"word": "accumulate", "definition": "Gather together or acquire an increasing number or quantity of."},
        {"word": "accusation", "definition": "A charge or claim that someone has done something illegal or wrong."},
        {"word": "acoustics", "definition": "The properties or qualities of a room or building that determine how sound is transmitted in it."},
        {"word": "acquisition", "definition": "An asset or object bought or obtained, typically by a library or museum."},
        {"word": "activate", "definition": "Make (something) active or operative."},
        {"word": "acute", "definition": "Present or experienced to a severe or intense degree."},
        {"word": "adaptation", "definition": "The action or process of adapting or being adapted."},
        {"word": "adherent", "definition": "Someone who supports a particular party, person, or set of ideas."},
        {"word": "adjacent", "definition": "Next to or adjoining something else."},
        {"word": "adjustment", "definition": "A small alteration or movement made to achieve a desired fit, appearance, or result."},
        {"word": "administer", "definition": "Manage and be responsible for the running of (a business, organization, etc.)."},
        {"word": "admonish", "definition": "Warn or reprimand someone firmly."},
        {"word": "adversity", "definition": "Difficulties; misfortune."},
        {"word": "affiliate", "definition": "Officially attach or connect (a subsidiary group or a person) to an organization."},
        {"word": "affirm", "definition": "State as a fact strongly and publicly."},
        {"word": "aggregate", "definition": "A whole formed by combining several (typically disparate) elements."},
        {"word": "agitation", "definition": "A state of anxiety or nervous excitement."},
        {"word": "align", "definition": "Place or arrange (things) in a straight line."},
        {"word": "allegation", "definition": "A claim or assertion that someone has done something illegal or wrong, typically one made without proof."},
        {"word": "allocate", "definition": "Distribute (resources or duties) for a particular purpose."},
        {"word": "allude", "definition": "Suggest or call attention to indirectly; hint at."},
        {"word": "amalgamate", "definition": "Combine or unite to form one organization or structure."},
        {"word": "ambiguity", "definition": "The quality of being open to more than one interpretation; inexactness."},
        {"word": "amend", "definition": "Make minor changes in (a text) in order to make it fairer, more accurate, or more up-to-date."},
        {"word": "amplitude", "definition": "The maximum extent of a vibration or oscillation, measured from the position of equilibrium."},
        {"word": "analogy", "definition": "A comparison between two things, typically for the purpose of explanation or clarification."},
        {"word": "analytic", "definition": "Relating to or using analysis or logical reasoning."},
        {"word": "animate", "definition": "Bring to life."},
        {"word": "annihilate", "definition": "Destroy utterly; obliterate."},
        {"word": "annotate", "definition": "Add notes to (a text or diagram) giving explanation or comment."},
        {"word": "anomaly", "definition": "Something that deviates from what is standard, normal, or expected."},
        {"word": "antagonist", "definition": "A person who actively opposes or is hostile to someone or something; an adversary."},
        {"word": "antecedent", "definition": "A thing or event that existed before or logically precedes another."},
        {"word": "anthology", "definition": "A published collection of poems or other pieces of writing."}
      ]
    },
    {
      "week_id": 15,
      "words_data": [
        {"word": "antidote", "definition": "A medicine taken or given to counteract a particular poison."},
        {"word": "antiquity", "definition": "The ancient past, especially the period before the Middle Ages."},
        {"word": "antonym", "definition": "A word opposite in meaning to another (e.g., bad and good)."},
        {"word": "apathy", "definition": "Lack of interest, enthusiasm, or concern."},
        {"word": "aperture", "definition": "An opening, hole, or gap."},
        {"word": "apex", "definition": "The top or highest part of something, especially one forming a point."},
        {"word": "appall", "definition": "Greatly dismay or horrify."},
        {"word": "apparel", "definition": "Clothing."},
        {"word": "append", "definition": "Add (something) as an attachment or supplement."},
        {"word": "apprehension", "definition": "Anxiety or fear that something bad or unpleasant will happen."},
        {"word": "appropriate", "definition": "Suitable or proper in the circumstances."},
        {"word": "approximate", "definition": "Close to the actual, but not completely accurate or exact."},
        {"word": "arbiter", "definition": "A person who settles a dispute or has ultimate authority in a matter."},
        {"word": "arbitrary", "definition": "Based on random choice or personal whim, rather than any reason or system."},
        {"word": "archaic", "definition": "Very old or old-fashioned."},
        {"word": "articulate", "definition": "Having or showing the ability to speak fluently and coherently."},
        {"word": "ascertain", "definition": "Find (something) out for certain; make sure of."},
        {"word": "aspersion", "definition": "An attack on the reputation or integrity of someone or something."},
        {"word": "aspire", "definition": "Direct one's hopes or ambitions toward achieving something."},
        {"word": "assault", "definition": "Make a physical attack on."},
        {"word": "assemble", "definition": "Gather together in one place for a common purpose."},
        {"word": "assert", "definition": "State a fact or belief confidently and forcefully."},
        {"word": "assess", "definition": "Evaluate or estimate the nature, ability, or quality of."},
        {"word": "asset", "definition": "A useful or valuable thing, person, or quality."},
        {"word": "assimilate", "definition": "Take in (information, ideas, or culture) and understand fully."},
        {"word": "assuage", "definition": "Make (an unpleasant feeling) less intense."},
        {"word": "astute", "definition": "Having or showing an ability to accurately assess situations or people and turn this to one's advantage."},
        {"word": "asylum", "definition": "The protection granted by a nation to someone who has left their native country as a political refugee."},
        {"word": "atone", "definition": "Make amends or reparation."},
        {"word": "atrophy", "definition": "(Of body tissue or an organ) waste away, typically due to the degeneration of cells."},
        {"word": "attain", "definition": "Succeed in achieving (something that one desires and has worked for)."},
        {"word": "attribute", "definition": "Regard something as being caused by (someone or something)."},
        {"word": "audacious", "definition": "Showing a willingness to take surprisingly bold risks."},
        {"word": "augment", "definition": "Make (something) greater by adding to it; increase."},
        {"word": "auspicious", "definition": "Conducive to success; favorable."},
        {"word": "authentic", "definition": "Of undisputed origin; genuine."},
        {"word": "authority", "definition": "The power or right to give orders, make decisions, and enforce obedience."},
        {"word": "automate", "definition": "Convert (a process or facility) to largely automatic operation."},
        {"word": "autonomous", "definition": "Having self-government, at least to a significant degree."},
        {"word": "aversion", "definition": "A strong dislike or disinclination."}
      ]
    }
  ]
}
    