{
  "title": "8th Grade English Vocabulary Dictionary",
  "weeks_definitions": [
    {
      "week_id": 1,
      "words_data": [
        {"word": "accommodate", "definition": "To provide space or a place to stay for someone."},
        {"word": "analyze", "definition": "To examine something in detail to understand its structure or meaning."},
        {"word": "argument", "definition": "A disagreement or a set of reasons given to support an idea."},
        {"word": "bilingual", "definition": "Able to speak two different languages fluently."},
        {"word": "committee", "definition": "A group of people chosen to represent a larger organization and make decisions."},
        {"word": "conscience", "definition": "An inner feeling or voice that guides you to do what is right."},
        {"word": "courageous", "definition": "Very brave and determined in the face of danger or difficulty."},
        {"word": "criticism", "definition": "The act of expressing disapproval or pointing out faults."},
        {"word": "descendant", "definition": "A person who is related to someone who lived in the past."},
        {"word": "emergency", "definition": "A serious, unexpected situation that requires immediate action."},
        {"word": "exaggerate", "definition": "To describe something as being larger or better than it really is."},
        {"word": "fascinating", "definition": "Extremely interesting or charming."},
        {"word": "guarantee", "definition": "A formal promise that a product or service will meet certain standards."},
        {"word": "humorous", "definition": "Funny or causing laughter."},
        {"word": "identity", "definition": "Who a person is, or the qualities that make them different from others."},
        {"word": "illustrate", "definition": "To explain something by using examples or pictures."},
        {"word": "jewelry", "definition": "Decorative items like rings or necklaces worn on the body."},
        {"word": "laboratory", "definition": "A room or building used for scientific research or experiments."},
        {"word": "license", "definition": "An official document giving permission to do or own something."},
        {"word": "literature", "definition": "Written works, such as books, poems, and plays, that have artistic value."},
        {"word": "mortgage", "definition": "A legal agreement where a bank lends money to buy a house."},
        {"word": "noticeable", "definition": "Easy to see or observe."},
        {"word": "occasion", "definition": "A particular event or a special time."},
        {"word": "opponent", "definition": "Someone who is against you in a contest, game, or argument."},
        {"word": "permanent", "definition": "Lasting or intended to last forever."},
        {"word": "persuade", "definition": "To convince someone to do or believe something through reasoning."},
        {"word": "questionnaire", "definition": "A list of questions used to gather information from people."},
        {"word": "recommendation", "definition": "A suggestion or advice about what is best for a particular purpose."},
        {"word": "restaurant", "definition": "A place where people pay to sit and eat meals that are cooked there."},
        {"word": "rhythm", "definition": "A strong, regular, repeated pattern of movement or sound."},
        {"word": "secretary", "definition": "A person employed to handle records, letters, and administrative tasks."},
        {"word": "significant", "definition": "Great or important enough to be worthy of attention."},
        {"word": "sophomore", "definition": "A student in their second year of high school or college."},
        {"word": "temperature", "definition": "The degree of heat or cold in an object or environment."},
        {"word": "tolerance", "definition": "The ability to accept or put up with opinions or behaviors you dislike."},
        {"word": "tournament", "definition": "A series of contests between several players or teams."},
        {"word": "unanimous", "definition": "When everyone in a group is in complete agreement."},
        {"word": "variety", "definition": "A number of different things of the same general type."},
        {"word": "vehicle", "definition": "A machine, such as a car or bus, used for transporting people or goods."},
        {"word": "villain", "definition": "A character in a story who does evil things."}
      ]
    },
    {
      "week_id": 2,
      "words_data": [
        {"word": "abbreviate", "definition": "To make a word or phrase shorter."},
        {"word": "agriculture", "definition": "The science or practice of farming and growing crops."},
        {"word": "amateur", "definition": "A person who takes part in an activity for pleasure rather than as a job."},
        {"word": "catastrophe", "definition": "A sudden event that causes great damage or suffering."},
        {"word": "chromosome", "definition": "A structure found in cells that carries genetic information."},
        {"word": "circumference", "definition": "The distance around the edge of a circle."},
        {"word": "competition", "definition": "An event where people or teams try to win against each other."},
        {"word": "conjunction", "definition": "A word used to connect sentences or parts of sentences together."},
        {"word": "development", "definition": "The process of growing, changing, or becoming more advanced."},
        {"word": "diagram", "definition": "A simplified drawing showing how something works or is organized."},
        {"word": "discipline", "definition": "The practice of training people to obey rules and using punishment to correct them."},
        {"word": "eclipse", "definition": "When the sun or moon is hidden by another celestial body."},
        {"word": "encyclopedia", "definition": "A book or set of books giving information on many subjects."},
        {"word": "environment", "definition": "The natural world around us, including air, water, and land."},
        {"word": "equivalent", "definition": "Equal in value, amount, or meaning."},
        {"word": "excursion", "definition": "A short trip or outing, usually for pleasure."},
        {"word": "government", "definition": "The group of people with the authority to rule a country or state."},
        {"word": "governor", "definition": "The elected leader of a state or territory."},
        {"word": "hazardous", "definition": "Dangerous or risky to health and safety."},
        {"word": "hesitate", "definition": "To pause before doing something because you are unsure."},
        {"word": "immigrant", "definition": "A person who comes to live permanently in a foreign country."},
        {"word": "interval", "definition": "A period of time or distance between two events or objects."},
        {"word": "jurisdiction", "definition": "The official power to make legal decisions and judgments."},
        {"word": "kindergarten", "definition": "A school or class for young children before they start first grade."},
        {"word": "magnificent", "definition": "Very beautiful, impressive, or grand."},
        {"word": "maintenance", "definition": "The work of keeping something in good condition."},
        {"word": "manuscript", "definition": "A handwritten or typed version of a book before it is printed."},
        {"word": "necessity", "definition": "The state of being required or indispensable."},
        {"word": "orchestra", "definition": "A large group of musicians playing different instruments together."},
        {"word": "pamphlet", "definition": "A small booklet or leaflet containing information on a single subject."},
        {"word": "physical", "definition": "Relating to the body rather than the mind."},
        {"word": "privilege", "definition": "A special right or advantage given only to a particular person or group."},
        {"word": "rectangle", "definition": "A four-sided shape with four right angles and unequal adjacent sides."},
        {"word": "rehearsal", "definition": "A practice session for a play, concert, or other performance."},
        {"word": "satellite", "definition": "An object that orbits around a planet or star."},
        {"word": "scrutiny", "definition": "Critical and thorough observation or examination."},
        {"word": "silhouette", "definition": "The dark shape and outline of someone or something against a light background."},
        {"word": "technique", "definition": "A particular way of doing something, especially one requiring skill."},
        {"word": "veteran", "definition": "A person who has served in the military; also someone with long experience."},
        {"word": "warranty", "definition": "A written promise to repair or replace a product if it breaks."}
      ]
    },
    {
      "week_id": 3,
      "words_data": [
        {"word": "absorption", "definition": "The process by which one thing takes in another."},
        {"word": "accessory", "definition": "Something added to something else to make it more useful or attractive."},
        {"word": "acoustics", "definition": "The branch of physics that deals with the properties of sound."},
        {"word": "acquaintance", "definition": "A person one knows slightly, but who is not a close friend."},
        {"word": "adolescence", "definition": "The period of life when a person develops from a child into an adult."},
        {"word": "affidavit", "definition": "A written statement confirmed by oath or affirmation for use as evidence in court."},
        {"word": "alignment", "definition": "Arranging things in a straight line or in correct positions relative to each other."},
        {"word": "antiseptic", "definition": "A substance that prevents the growth of disease-causing microorganisms."},
        {"word": "apparatus", "definition": "The technical equipment or machinery needed for a particular activity."},
        {"word": "architecture", "definition": "The art and science of designing and constructing buildings."},
        {"word": "assessment", "definition": "The evaluation or estimation of the nature, quality, or ability of someone or something."},
        {"word": "bankruptcy", "definition": "A legal state where a person or business cannot pay their debts."},
        {"word": "boulevard", "definition": "A wide street in a town or city, typically one lined with trees."},
        {"word": "bureaucracy", "definition": "A complex system of government or business administration with many rules."},
        {"word": "calculator", "definition": "A small electronic device used for mathematical calculations."},
        {"word": "candidate", "definition": "A person who applies for a job or is nominated for election."},
        {"word": "carnivore", "definition": "An animal that feeds primarily on flesh or meat."},
        {"word": "chrysalis", "definition": "The hard shell that protects a caterpillar as it turns into a butterfly."},
        {"word": "coalition", "definition": "An alliance for combined action, especially a temporary union of political parties."},
        {"word": "collateral", "definition": "Something pledged as security for repayment of a loan."},
        {"word": "combustible", "definition": "Able to catch fire and burn easily."},
        {"word": "commentary", "definition": "An explanation or set of notes on a text; also a spoken account of an event."},
        {"word": "compassion", "definition": "Sympathetic pity and concern for the sufferings of others."},
        {"word": "compensation", "definition": "Something, typically money, awarded to someone as a recompense for loss or injury."},
        {"word": "competitor", "definition": "A person or organization that is competing against others."},
        {"word": "concentration", "definition": "The action of focusing one's full attention; also the amount of a substance in a space."},
        {"word": "condominium", "definition": "A building or complex of buildings containing a number of individually owned apartments."},
        {"word": "confirmation", "definition": "The action of establishing the truth or correctness of something."},
        {"word": "consequence", "definition": "A result or effect of an action or condition."},
        {"word": "constitution", "definition": "A set of basic laws and principles by which a country is governed."},
        {"word": "contagious", "definition": "Spread from one person or organism to another by direct or indirect contact."},
        {"word": "corporation", "definition": "A large company or group authorized to act as a single entity."},
        {"word": "counselor", "definition": "A person trained to give guidance on personal, social, or psychological problems."},
        {"word": "deficiency", "definition": "A lack or shortage of something necessary."},
        {"word": "demolition", "definition": "The act of pulling or knocking down a building or structure."},
        {"word": "denominator", "definition": "The bottom number in a fraction, showing how many parts the whole is divided into."},
        {"word": "deposition", "definition": "The process of giving sworn evidence; also the geological process of sediment settling."},
        {"word": "desolate", "definition": "A place that is empty, bleak, and lonely."}
      ]
    },
    {
      "week_id": 4,
      "words_data": [
        {"word": "deteriorate", "definition": "To become progressively worse in quality or condition."},
        {"word": "devastate", "definition": "To destroy or ruin something completely."},
        {"word": "diaphragm", "definition": "The muscle that separates the chest from the abdomen and helps with breathing."},
        {"word": "discrepancy", "definition": "A lack of compatibility or similarity between two or more facts."},
        {"word": "disposition", "definition": "A person's inherent qualities of mind and character."},
        {"word": "distinction", "definition": "A difference or contrast between similar things or people."},
        {"word": "efficiency", "definition": "Achieving maximum productivity with minimum wasted effort or expense."},
        {"word": "eligibility", "definition": "The state of having the right to do or obtain something."},
        {"word": "eloquent", "definition": "Fluent or persuasive in speaking or writing."},
        {"word": "emigration", "definition": "The act of leaving one's own country to settle permanently in another."},
        {"word": "emphasis", "definition": "Special importance, value, or prominence given to something."},
        {"word": "entrepreneur", "definition": "A person who sets up a business, taking on financial risks in the hope of profit."},
        {"word": "equilibrium", "definition": "A state in which opposing forces or influences are perfectly balanced."},
        {"word": "evacuation", "definition": "The act of removing people from a place of danger to a safer area."},
        {"word": "exaggeration", "definition": "A statement that represents something as better or worse than it really is."},
        {"word": "exceptional", "definition": "Unusually good; much better than average."},
        {"word": "executive", "definition": "A person with senior managerial responsibility in a business."},
        {"word": "exhibition", "definition": "A public display of works of art or items of interest."},
        {"word": "expectancy", "definition": "The state of thinking or hoping that something, especially something good, will happen."},
        {"word": "extravagant", "definition": "Spending much more than is necessary or wise."},
        {"word": "extremist", "definition": "A person who holds extreme or fanatical political or religious views."},
        {"word": "fabrication", "definition": "The act of inventing something, typically a lie; also the manufacturing process."},
        {"word": "familiarity", "definition": "Close acquaintance with or knowledge of something."},
        {"word": "fermentation", "definition": "The chemical breakdown of a substance by bacteria or yeast, typically involved in making bread or alcohol."},
        {"word": "fluorescent", "definition": "Giving off bright light when exposed to radiation; very vivid."},
        {"word": "formation", "definition": "The action of forming or the process of being formed; also a structure."},
        {"word": "formidable", "definition": "Inspiring fear or respect through being impressively large, powerful, or intense."},
        {"word": "founder", "definition": "A person who establishes an institution or settlement; also, to fail or sink."},
        {"word": "galaxy", "definition": "A system of millions or billions of stars, together with gas and dust, held by gravity."},
        {"word": "generator", "definition": "A machine that converts mechanical energy into electricity."},
        {"word": "gladiator", "definition": "A man trained to fight with weapons against other men or wild animals in Ancient Rome."},
        {"word": "grandeur", "definition": "Splendor and impressiveness, especially of appearance or style."},
        {"word": "grievance", "definition": "A real or imagined wrong or other cause for complaint or protest."},
        {"word": "hereditary", "definition": "Passed on from parent to child through genes."},
        {"word": "hierarchy", "definition": "A system in which members are ranked according to relative status or authority."},
        {"word": "homogeneous", "definition": "Consisting of parts that are all of the same kind."},
        {"word": "hydrogen", "definition": "The lightest chemical element; it is a gas with no color or smell."},
        {"word": "hypocrisy", "definition": "Pretending to have moral standards or beliefs that one does not actually follow."},
        {"word": "hypothesis", "definition": "A proposed explanation made on the basis of limited evidence as a starting point for investigation."}
      ]
    },
    {
      "week_id": 5,
      "words_data": [
        {"word": "illuminate", "definition": "To light up or make something clear and easier to understand."},
        {"word": "illustration", "definition": "A picture or diagram that explains or decorates a text."},
        {"word": "imagery", "definition": "Visually descriptive or figurative language in writing."},
        {"word": "imitation", "definition": "A copy of something else, often intended to look like the original."},
        {"word": "impartial", "definition": "Fair and just; not favoring one side over another."},
        {"word": "implement", "definition": "To put a decision, plan, or agreement into effect."},
        {"word": "implication", "definition": "The conclusion that can be drawn from something although it is not explicitly stated."},
        {"word": "impression", "definition": "An idea, feeling, or opinion about something or someone."},
        {"word": "inanimate", "definition": "Not alive; showing no signs of life."},
        {"word": "inauguration", "definition": "The formal ceremony to mark the beginning of a major role or institution."},
        {"word": "incentive", "definition": "Something that motivates or encourages someone to do something."},
        {"word": "incidence", "definition": "The rate of occurrence of something, such as a disease."},
        {"word": "indefinite", "definition": "Not clearly expressed or defined; lasting for an unknown period."},
        {"word": "indictment", "definition": "A formal charge or accusation of a serious crime."},
        {"word": "indigenous", "definition": "Originating or occurring naturally in a particular place; native."},
        {"word": "inducement", "definition": "A thing that persuades or influences someone to do something."},
        {"word": "inevitable", "definition": "Certain to happen; unavoidable."},
        {"word": "infantry", "definition": "Soldiers who fight on foot."},
        {"word": "inflammation", "definition": "A physical condition where part of the body becomes reddened, swollen, and painful."},
        {"word": "influential", "definition": "Having great power or influence over someone or something."},
        {"word": "ingenious", "definition": "Clever, original, and inventive."},
        {"word": "ingredient", "definition": "One of the substances that are combined to make a particular dish."},
        {"word": "inhabitant", "definition": "A person or animal that lives in or occupies a place."},
        {"word": "inheritance", "definition": "Money, property, or traits received from ancestors."},
        {"word": "innocence", "definition": "The state of being free from sin or guilt."},
        {"word": "innovation", "definition": "A new method, idea, or product."},
        {"word": "inoculation", "definition": "The action of vaccinating someone to produce immunity against a disease."},
        {"word": "inscription", "definition": "Words carved or written on something, such as a monument or book."},
        {"word": "insomnia", "definition": "Habitual sleeplessness; inability to sleep."},
        {"word": "inspection", "definition": "A careful examination or scrutiny of something."},
        {"word": "instinctive", "definition": "Doing something naturally without thinking."},
        {"word": "institute", "definition": "An organization having a particular purpose, especially scientific or educational."},
        {"word": "insurance", "definition": "A practice or arrangement by which a company provides a guarantee of compensation for loss."},
        {"word": "integrity", "definition": "The quality of being honest and having strong moral principles."},
        {"word": "intellectual", "definition": "Relating to the ability to think and understand complex ideas."},
        {"word": "intelligence", "definition": "The ability to acquire and apply knowledge and skills."},
        {"word": "intensive", "definition": "Concentrated on a single area or subject; very thorough."},
        {"word": "interference", "definition": "The action of interfering or getting in the way of something."},
        {"word": "intermediate", "definition": "Coming between two things in time, place, order, or character."}
      ]
    },
    {
      "week_id": 6,
      "words_data": [
        {"word": "interpretation", "definition": "The action of explaining the meaning of something."},
        {"word": "interrogate", "definition": "To ask questions of someone, especially a suspect, closely and aggressively."},
        {"word": "intervene", "definition": "To come between so as to prevent or alter a result or course of events."},
        {"word": "intricate", "definition": "Very complicated or detailed."},
        {"word": "introduction", "definition": "The action of introducing something or a preliminary part of a book or speech."},
        {"word": "intuition", "definition": "The ability to understand something immediately without the need for conscious reasoning."},
        {"word": "invaluable", "definition": "Extremely useful; indispensable."},
        {"word": "inventory", "definition": "A complete list of items such as property, goods in stock, or the contents of a building."},
        {"word": "investigator", "definition": "A person who carries out a formal inquiry or investigation."},
        {"word": "investment", "definition": "The action of investing money for profit or material result."},
        {"word": "invitation", "definition": "A written or spoken request to invite someone to an event."},
        {"word": "involuntary", "definition": "Done without will or conscious control."},
        {"word": "irrational", "definition": "Not logical or reasonable."},
        {"word": "irrigation", "definition": "The supply of water to land or crops to help growth."},
        {"word": "jeopardize", "definition": "To put someone or something into a situation in which there is a danger of loss or harm."},
        {"word": "judicial", "definition": "Relating to a judgment, the law, or the administration of justice."},
        {"word": "justification", "definition": "The action of showing something to be right or reasonable."},
        {"word": "laboratory", "definition": "A place equipped for scientific experiments or research."},
        {"word": "landscape", "definition": "All the visible features of an area of countryside or land."},
        {"word": "legislature", "definition": "The group of people with the power to make laws."},
        {"word": "legitimate", "definition": "Conforming to the law or to rules."},
        {"word": "liability", "definition": "The state of being responsible for something, especially by law."},
        {"word": "lieutenant", "definition": "A rank of officer in the army or navy."},
        {"word": "likelihood", "definition": "The probability that something will happen."},
        {"word": "limitation", "definition": "A restriction or a limit."},
        {"word": "literature", "definition": "Written works, especially those considered of superior or lasting artistic merit."},
        {"word": "livelihood", "definition": "A means of securing the necessities of life, such as a job."},
        {"word": "location", "definition": "A particular place or position."},
        {"word": "longitude", "definition": "The distance of a place east or west of the meridian at Greenwich, England."},
        {"word": "lucrative", "definition": "Producing a great deal of profit."},
        {"word": "magnificent", "definition": "Impressively beautiful, elaborate, or extravagant; striking."},
        {"word": "maintenance", "definition": "The work of keeping something in proper condition."},
        {"word": "malicious", "definition": "Intending or intended to do harm."},
        {"word": "malnutrition", "definition": "Lack of proper nutrition, caused by not having enough to eat or not eating the right things."},
        {"word": "manageable", "definition": "Able to be controlled or dealt with without difficulty."},
        {"word": "manifest", "definition": "Clear or obvious to the eye or mind."},
        {"word": "manufacture", "definition": "The making of articles on a large scale using machinery."},
        {"word": "manuscript", "definition": "A book, document, or piece of music written by hand rather than typed or printed."},
        {"word": "maritime", "definition": "Relating to the sea, especially in relation to commercial shipping or naval matters."}
      ]
    },
    {
      "week_id": 7,
      "words_data": [
        {"word": "melancholy", "definition": "A feeling of pensive sadness, typically with no obvious cause."},
        {"word": "memorandum", "definition": "A written message in business or diplomacy; also a note to aid the memory."},
        {"word": "merchandise", "definition": "Goods to be bought and sold."},
        {"word": "metabolism", "definition": "The chemical processes that occur within a living organism to maintain life."},
        {"word": "metropolitan", "definition": "Relating to a large city and its surrounding areas."},
        {"word": "migration", "definition": "The movement of people or animals from one place to another."},
        {"word": "miniature", "definition": "Very small of its kind; much smaller than normal."},
        {"word": "minority", "definition": "A small part of a larger group."},
        {"word": "miscellaneous", "definition": "Of various types or from different sources; mixed."},
        {"word": "mischievous", "definition": "Causing or showing a fondness for causing trouble in a playful way."},
        {"word": "misconception", "definition": "A view or opinion that is incorrect because based on faulty thinking or understanding."},
        {"word": "misfortune", "definition": "Bad luck or an unfortunate event."},
        {"word": "monarchy", "definition": "A form of government with a monarch (king or queen) at the head."},
        {"word": "mortgage", "definition": "A loan from a bank to purchase a property."},
        {"word": "municipal", "definition": "Relating to a city or town or its governing body."},
        {"word": "narrative", "definition": "A spoken or written account of connected events; a story."},
        {"word": "nationalist", "definition": "A person who strongly supports their own nation and its interests."},
        {"word": "navigation", "definition": "The process or activity of accurately ascertaining one's position and planning a route."},
        {"word": "necessity", "definition": "The state or fact of being required."},
        {"word": "negligence", "definition": "Failure to take proper care in doing something."},
        {"word": "negotiate", "definition": "To try to reach an agreement or compromise through discussion."},
        {"word": "neutron", "definition": "A subatomic particle without an electric charge."},
        {"word": "nominee", "definition": "A person who is formally entered as a candidate for an office or award."},
        {"word": "nostalgia", "definition": "A sentimental longing for the past."},
        {"word": "notorious", "definition": "Famous or well known, typically for some bad quality or deed."},
        {"word": "nuisance", "definition": "A person, thing, or situation causing annoyance or inconvenience."},
        {"word": "numerical", "definition": "Relating to or expressed as a number or numbers."},
        {"word": "nutrition", "definition": "The process of providing or obtaining the food necessary for health and growth."},
        {"word": "obligation", "definition": "An act or course of action to which a person is morally or legally bound."},
        {"word": "obsolescence", "definition": "The process of becoming obsolete or out of date."},
        {"word": "obstacle", "definition": "A thing that blocks one's way or prevents progress."},
        {"word": "occupation", "definition": "A job or profession; also the action of living in or taking over a space."},
        {"word": "occurrence", "definition": "An incident or event."},
        {"word": "offensive", "definition": "Causing someone to feel deeply hurt, upset, or angry."},
        {"word": "omission", "definition": "Someone or something that has been left out or excluded."},
        {"word": "opinionated", "definition": "Holding to one's own ideas and opinions too strongly."},
        {"word": "opponent", "definition": "Someone who competes against or fights another in a contest, game, or argument."},
        {"word": "opportunity", "definition": "A set of circumstances that makes it possible to do something."},
        {"word": "oppression", "definition": "Prolonged cruel or unjust treatment or control."},
        {"word": "optimism", "definition": "Hopefulness and confidence about the future or the success of something."}
      ]
    },
    {
      "week_id": 8,
      "words_data": [
        {"word": "organism", "definition": "An individual animal, plant, or single-celled life form."},
        {"word": "orientation", "definition": "The relative physical position of something; also a period of introduction to a new situation."},
        {"word": "original", "definition": "Present or existing from the beginning; not a copy."},
        {"word": "outrageous", "definition": "Shockingly bad or excessive; bold and unusual."},
        {"word": "overestimate", "definition": "To estimate that something is greater or more important than it really is."},
        {"word": "pamphlet", "definition": "A small booklet or leaflet containing information on a single subject."},
        {"word": "panorama", "definition": "A wide view of a surrounding area."},
        {"word": "paradox", "definition": "A statement that seems contradictory but may be true."},
        {"word": "parenthesis", "definition": "A word or phrase inserted as an explanation, often set off by brackets."},
        {"word": "participant", "definition": "A person who takes part in something."},
        {"word": "penetrate", "definition": "To succeed in forcing a way into or through something."},
        {"word": "perception", "definition": "The ability to see, hear, or become aware of something through the senses."},
        {"word": "percussion", "definition": "Musical instruments played by striking, such as drums."},
        {"word": "perennial", "definition": "Lasting or existing for a long or apparently infinite time."},
        {"word": "performance", "definition": "An act of staging or presenting a play, concert, or other form of entertainment."},
        {"word": "permanent", "definition": "Lasting or intended to last or remain unchanged indefinitely."},
        {"word": "permissible", "definition": "Allowed; permitted."},
        {"word": "persistence", "definition": "Firm or obstinate continuance in a course of action in spite of difficulty."},
        {"word": "perspective", "definition": "A particular attitude toward or way of regarding something; a point of view."},
        {"word": "persuasion", "definition": "The action or fact of persuading someone or of being persuaded."},
        {"word": "pertinent", "definition": "Relevant or applicable to a particular matter."},
        {"word": "phenomenon", "definition": "A fact or situation that is observed to exist or happen."},
        {"word": "philosophy", "definition": "The study of the fundamental nature of knowledge, reality, and existence."},
        {"word": "photosynthesis", "definition": "The process by which green plants use sunlight to synthesize food from water and carbon dioxide."},
        {"word": "pioneer", "definition": "A person who is among the first to explore or settle a new area."},
        {"word": "portfolio", "definition": "A large, thin, flat case for loose sheets of paper; a collection of a person's work."},
        {"word": "posthumous", "definition": "Occurring, awarded, or appearing after the death of the originator."},
        {"word": "potential", "definition": "Having or showing the capacity to become or develop into something in the future."},
        {"word": "precaution", "definition": "A measure taken in advance to prevent something dangerous or unpleasant from happening."},
        {"word": "precedent", "definition": "An earlier event or action that is regarded as an example or guide for future cases."},
        {"word": "precision", "definition": "The quality, condition, or fact of being exact and accurate."},
        {"word": "predominant", "definition": "Present as the strongest or main element."},
        {"word": "preliminary", "definition": "Denoting an action or event preceding or done in preparation for something more important."},
        {"word": "preposition", "definition": "A word governing a noun or pronoun and expressing a relation to another word (e.g., 'on', 'in')."},
        {"word": "prestigious", "definition": "Inspiring respect and admiration; having high status."},
        {"word": "priority", "definition": "The fact or condition of being regarded as more important."},
        {"word": "probability", "definition": "The extent to which something is probable; the likelihood of something happening."},
        {"word": "procedure", "definition": "An established or official way of doing something."},
        {"word": "proclamation", "definition": "A public or official announcement, especially one dealing with a matter of great importance."},
        {"word": "profession", "definition": "A paid occupation, especially one that involves prolonged training and a formal qualification."}
      ]
    },
    {
      "week_id": 9,
      "words_data": [
        {"word": "proficiency", "definition": "A high degree of skill; expertise."},
        {"word": "prohibition", "definition": "The action of forbidding something, especially by law."},
        {"word": "projection", "definition": "An estimate of future situations; the presentation of an image on a surface."},
        {"word": "prominent", "definition": "Important; famous; projecting from something."},
        {"word": "propaganda", "definition": "Information, especially of a biased or misleading nature, used to promote a political cause or point of view."},
        {"word": "proposition", "definition": "A statement or assertion that expresses a judgment or opinion."},
        {"word": "prosperity", "definition": "The state of being prosperous; successfulness and wealth."},
        {"word": "protective", "definition": "Intended to protect someone or something."},
        {"word": "protocol", "definition": "The official procedure or system of rules-governing affairs of state or diplomatic occasions."},
        {"word": "provision", "definition": "The action of providing or supplying something for use."},
        {"word": "proximity", "definition": "Nearness in space, time, or relationship."},
        {"word": "psychology", "definition": "The scientific study of the human mind and its functions."},
        {"word": "publication", "definition": "The action of making something generally known; a printed work."},
        {"word": "puncture", "definition": "A small hole in a tire or skin, made by a sharp object."},
        {"word": "qualification", "definition": "A quality or accomplishment that makes someone suitable for a job."},
        {"word": "quarantine", "definition": "A state or period of isolation for people or animals that have arrived from elsewhere or been exposed to infectious disease."},
        {"word": "quivering", "definition": "Trembling or shaking with a slight rapid motion."},
        {"word": "radiation", "definition": "The emission of energy as electromagnetic waves."},
        {"word": "realistic", "definition": "Having or showing a sensible and practical idea of what can be achieved."},
        {"word": "reassure", "definition": "To say or do something to remove the doubts and fears of someone."},
        {"word": "rebellion", "definition": "An act of violent or open resistance to an established government or ruler."},
        {"word": "receipt", "definition": "A written acknowledgment that a specified article or sum of money has been received."},
        {"word": "recede", "definition": "To go or move back or further away from a previous position."},
        {"word": "reciprocal", "definition": "Given, felt, or done in return."},
        {"word": "recognition", "definition": "The action or process of recognizing or being recognized."},
        {"word": "recommendation", "definition": "A suggestion or proposal as to the best course of action."},
        {"word": "recuperate", "definition": "To recover from illness or exertion."},
        {"word": "referendum", "definition": "A general vote by the electorate on a single political question."},
        {"word": "reflection", "definition": "The throwing back by a body or surface of light, heat, or sound without absorbing it."},
        {"word": "refractory", "definition": "Stubborn or unmanageable; resistant to a process or stimulus."},
        {"word": "regardless", "definition": "Without paying attention to the present situation."},
        {"word": "registrar", "definition": "An official responsible for keeping a register or official records."},
        {"word": "regulation", "definition": "A rule or directive made and maintained by an authority."},
        {"word": "reinforce", "definition": "To strengthen or support, especially with additional personnel or material."},
        {"word": "relevant", "definition": "Closely connected or appropriate to the matter at hand."},
        {"word": "reluctant", "definition": "Unwilling and hesitant; disinclined."},
        {"word": "remembrance", "definition": "The action of remembering something; a memory."},
        {"word": "renaissance", "definition": "A revival of or renewed interest in something; the cultural rebirth in Europe."},
        {"word": "renovation", "definition": "The action of renovating a building or an object."},
        {"word": "repetition", "definition": "The action of repeating something that has already been said or written."}
      ]
    },
    {
      "week_id": 10,
      "words_data": [
        {"word": "representative", "definition": "A person chosen or elected to speak and act for others."},
        {"word": "reservoir", "definition": "A large natural or artificial lake used as a source of water supply."},
        {"word": "resistance", "definition": "The refusal to accept or comply with something."},
        {"word": "resolution", "definition": "A firm decision to do or not to do something."},
        {"word": "respiration", "definition": "The action of breathing."},
        {"word": "responsibility", "definition": "The state or fact of having a duty to deal with something."},
        {"word": "restriction", "definition": "A limiting condition or measure, especially a legal one."},
        {"word": "retaliate", "definition": "Make an attack or assault in return for a similar attack."},
        {"word": "retrieval", "definition": "The process of getting something back from somewhere."},
        {"word": "revelation", "definition": "A surprising and previously unknown fact that has been disclosed."},
        {"word": "reverence", "definition": "Deep respect for someone or something."},
        {"word": "revision", "definition": "The action of revising; rereading and making changes."},
        {"word": "rhetoric", "definition": "The art of effective or persuasive speaking or writing."},
        {"word": "rigorous", "definition": "Extremely thorough, exhaustive, or accurate."},
        {"word": "roulette", "definition": "A gambling game played around a spinning wheel."},
        {"word": "sanitary", "definition": "Relating to the conditions that affect hygiene and health."},
        {"word": "saturate", "definition": "Cause something to become thoroughly soaked with liquid."},
        {"word": "scandalous", "definition": "Causing general public outrage by a perceived offense against morality."},
        {"word": "schedule", "definition": "A plan for carrying out a process or procedure."},
        {"word": "schematic", "definition": "Symbolic and simplified; a diagram of an electrical or mechanical system."},
        {"word": "scholarship", "definition": "A grant or payment made to support a student's education."},
        {"word": "scientific", "definition": "Based on or characterized by the methods and principles of science."},
        {"word": "scrutiny", "definition": "Critical observation or examination."},
        {"word": "secretary", "definition": "A person employed to handle records and letters."},
        {"word": "sediment", "definition": "Matter that settles to the bottom of a liquid."},
        {"word": "segregation", "definition": "The enforced separation of different racial groups in a country or community."},
        {"word": "sensation", "definition": "A physical feeling or perception resulting from something that happens to or comes into contact with the body."},
        {"word": "sequence", "definition": "A particular order in which related events, movements, or things follow each other."},
        {"word": "sergeant", "definition": "A rank of non-commissioned officer in the army or air force."},
        {"word": "significant", "definition": "Sufficiently great or important to be worthy of attention."},
        {"word": "silhouette", "definition": "The dark shape and outline of someone or something visible against a lighter background."},
        {"word": "similarity", "definition": "The state or fact of being similar."},
        {"word": "simile", "definition": "A figure of speech involving the comparison of one thing with another of a different kind (e.g., 'brave as a lion')."},
        {"word": "simultaneous", "definition": "Occurring, operating, or done at the same time."},
        {"word": "skeptical", "definition": "Not easily convinced; having doubts or reservations."},
        {"word": "soliloquy", "definition": "An act of speaking one's thoughts aloud when by oneself in a play."},
        {"word": "souvenir", "definition": "A thing that is kept as a reminder of a person, place, or event."},
        {"word": "sovereign", "definition": "Possessing supreme or ultimate power; a monarch."},
        {"word": "spectator", "definition": "A person who watches at a show, game, or other event."},
        {"word": "spontaneous", "definition": "Performed or occurring as a result of a sudden inner impulse."}
      ]
    },
    {
      "week_id": 11,
      "words_data": [
        {"word": "stabilization", "definition": "The process of making something stable or constant."},
        {"word": "stagnant", "definition": "Having no current or flow and often having an unpleasant smell as a consequence (water); showing no activity."},
        {"word": "statistic", "definition": "A fact or piece of data from a study of a large quantity of numerical data."},
        {"word": "stereotype", "definition": "A widely held but fixed and oversimplified image or idea of a particular type of person or thing."},
        {"word": "stimulus", "definition": "A thing or event that evokes a specific functional reaction in an organ or tissue."},
        {"word": "strategic", "definition": "Relating to the identification of long-term or overall aims and interests and the means of achieving them."},
        {"word": "submission", "definition": "The action or fact of accepting or yielding to a superior force."},
        {"word": "subordinate", "definition": "Lower in rank or position."},
        {"word": "subsequent", "definition": "Coming after something in time; following."},
        {"word": "substance", "definition": "A particular kind of matter with uniform properties."},
        {"word": "substantial", "definition": "Of considerable importance, size, or worth."},
        {"word": "suburban", "definition": "Relating to a residential area on the edge of a city."},
        {"word": "sufficient", "definition": "Enough; adequate."},
        {"word": "suffrage", "definition": "The right to vote in political elections."},
        {"word": "summation", "definition": "The process of adding things together; a summary."},
        {"word": "superintendent", "definition": "A person who manages or superintends an organization or activity."},
        {"word": "supersede", "definition": "Take the place of (a person or thing previously in authority or use)."},
        {"word": "supplement", "definition": "Something that completes or enhances something else when added to it."},
        {"word": "suppress", "definition": "Forcibly put an end to; prevent the development or expression of."},
        {"word": "surrogate", "definition": "A substitute, especially a person deputizing for another in a specific role."},
        {"word": "surveillance", "definition": "Close observation, especially of a suspected spy or criminal."},
        {"word": "suspension", "definition": "The action of suspending someone or something or the condition of being suspended."},
        {"word": "suspicion", "definition": "A feeling or belief that someone is guilty of an illegal or dishonest act."},
        {"word": "syllable", "definition": "A unit of pronunciation having one vowel sound, with or without surrounding consonants."},
        {"word": "symmetrical", "definition": "Made up of exactly similar parts facing each other or around an axis."},
        {"word": "symposium", "definition": "A conference or meeting to discuss a particular subject."},
        {"word": "syndrome", "definition": "A group of symptoms which consistently occur together."},
        {"word": "synthesis", "definition": "The combination of ideas to form a theory or system."},
        {"word": "systematic", "definition": "Done or acting according to a fixed plan or system; methodical."},
        {"word": "technical", "definition": "Relating to a particular subject, art, or craft, or its techniques."},
        {"word": "technology", "definition": "The application of scientific knowledge for practical purposes."},
        {"word": "temperament", "definition": "A person's nature, especially as it permanently affects their behavior."},
        {"word": "temporary", "definition": "Lasting for only a limited period of time; not permanent."},
        {"word": "tendency", "definition": "An inclination toward a particular characteristic or type of behavior."},
        {"word": "tentative", "definition": "Not certain or fixed; provisional."},
        {"word": "terminate", "definition": "Bring to an end."},
        {"word": "terrain", "definition": "A stretch of land, especially with regard to its physical features."},
        {"word": "territory", "definition": "An area of land under the jurisdiction of a ruler or state."},
        {"word": "testimony", "definition": "A formal written or spoken statement, especially one given in a court of law."},
        {"word": "therapeutic", "definition": "Relating to the healing of disease."}
      ]
    },
    {
      "week_id": 12,
      "words_data": [
        {"word": "threshold", "definition": "The strip of wood or stone forming the bottom of a doorway."},
        {"word": "tolerance", "definition": "The ability or willingness to tolerate something, in particular the existence of opinions or behavior that one does not necessarily agree with."},
        {"word": "topographical", "definition": "Relating to the arrangement of the physical features of an area."},
        {"word": "tournament", "definition": "A series of contests between several players or teams in a sport or game."},
        {"word": "tradition", "definition": "The transmission of customs or beliefs from generation to generation."},
        {"word": "trajectory", "definition": "The path followed by a projectile flying or an object moving under the action of given forces."},
        {"word": "transcend", "definition": "Be or go beyond the range or limits of."},
        {"word": "transition", "definition": "The process of changing from one state or condition to another."},
        {"word": "transmission", "definition": "The action or process of transmitting something."},
        {"word": "transparent", "definition": "Allowing light to pass through so that objects behind can be distinctly seen."},
        {"word": "treasurer", "definition": "A person appointed to administer or manage the financial assets of a society or city."},
        {"word": "tremendous", "definition": "Very great in amount, scale, or intensity."},
        {"word": "tribunal", "definition": "A court of justice."},
        {"word": "trilogy", "definition": "A group of three related novels, plays, films, or albums."},
        {"word": "triumphant", "definition": "Having won a battle or contest; victorious."},
        {"word": "trivial", "definition": "Of little value or importance."},
        {"word": "turbulence", "definition": "Violent or unsteady movement of air or water, or of some other fluid."},
        {"word": "ultraviolet", "definition": "Having a wavelength shorter than that of the violet end of the visible spectrum but longer than that of X-rays."},
        {"word": "unanimous", "definition": "Fully in agreement."},
        {"word": "unconscious", "definition": "Not conscious; done or existing without one realizing."},
        {"word": "underlie", "definition": "Be the cause or basis of."},
        {"word": "undermine", "definition": "Erode the base or foundation of; lessen the effectiveness of."},
        {"word": "undertake", "definition": "Commit oneself to and begin (a enterprise or responsibility)."},
        {"word": "uniform", "definition": "Not changing in form or character; remaining the same in all cases and at all times."},
        {"word": "unilateral", "definition": "Performed by or affecting only one person, group, or country involved in a particular situation, without the agreement of another or the others."},
        {"word": "universal", "definition": "Of, affecting, or done by all people or things in the world or in a particular group."},
        {"word": "unprecedented", "definition": "Never done or known before."},
        {"word": "unravel", "definition": "Undo (twisted, knitted, or woven threads)."},
        {"word": "utilitarian", "definition": "Designed to be useful or practical rather than attractive."},
        {"word": "utterance", "definition": "A spoken word, statement, or vocal sound."},
        {"word": "vacancy", "definition": "An unoccupied position or job."},
        {"word": "vaccination", "definition": "Treatment with a vaccine to produce immunity against a disease."},
        {"word": "vacuum", "definition": "A space entirely devoid of matter."},
        {"word": "validate", "definition": "Check or prove the validity or accuracy of."},
        {"word": "valuation", "definition": "An estimation of something's worth, especially one carried out by a professional appraiser."},
        {"word": "variable", "definition": "Not consistent or having a fixed pattern; liable to change."},
        {"word": "variation", "definition": "A change or difference in condition, amount, or level."},
        {"word": "vegetation", "definition": "Plants considered collectively, especially those found in a particular area or habitat."},
        {"word": "velocity", "definition": "The speed of something in a given direction."},
        {"word": "ventilate", "definition": "Cause air to enter and circulate freely in (a room or building)."}
      ]
    },
    {
      "week_id": 13,
      "words_data": [
        {"word": "verbal", "definition": "Relating to or in the form of words."},
        {"word": "verify", "definition": "Make sure that (something) is true, accurate, or justified."},
        {"word": "versatile", "definition": "Able to adapt or be adapted to many different functions or activities."},
        {"word": "vertical", "definition": "At right angles to a horizontal plane; upright."},
        {"word": "veteran", "definition": "A person who has had long experience in a particular field."},
        {"word": "veto", "definition": "A constitutional right to reject a decision or proposal made by a law-making body."},
        {"word": "vicinity", "definition": "The area near or surrounding a particular place."},
        {"word": "victim", "definition": "A person harmed, injured, or killed as a result of a crime, accident, or other event or action."},
        {"word": "viewpoint", "definition": "A particular attitude or way of considering a matter."},
        {"word": "vigorous", "definition": "Strong, healthy, and full of energy."},
        {"word": "violation", "definition": "The action of violating someone or something."},
        {"word": "virtual", "definition": "Almost or nearly as described, but not completely or according to strict definition."},
        {"word": "visible", "definition": "Able to be seen."},
        {"word": "visual", "definition": "Relating to seeing or sight."},
        {"word": "vitality", "definition": "The state of being strong and active; energy."},
        {"word": "vocalize", "definition": "Utter (a sound or word)."},
        {"word": "vocation", "definition": "A strong feeling of suitability for a particular career or occupation."},
        {"word": "volatile", "definition": "Liable to change rapidly and unpredictably, especially for the worse."},
        {"word": "volume", "definition": "The amount of space that a substance or object occupies."},
        {"word": "voluntary", "definition": "Done, given, or acting of one's own free will."},
        {"word": "vulnerable", "definition": "Susceptible to physical or emotional attack or harm."},
        {"word": "warranty", "definition": "A written guarantee, issued to the purchaser of an article by its manufacturer, promising to repair or replace it if necessary."},
        {"word": "wasteful", "definition": "Using or expending something of value carelessly, extravagantly, or to no purpose."},
        {"word": "welfare", "definition": "The health, happiness, and fortunes of a person or group."},
        {"word": "whereas", "definition": "In contrast or comparison with the fact that."},
        {"word": "wholesale", "definition": "The business of selling of goods in large quantities and at low prices to be retailed by others."},
        {"word": "wilderness", "definition": "An uncultivated, uninhabited, and inhospitable region."},
        {"word": "withdrawal", "definition": "The action of withdrawing something."},
        {"word": "witness", "definition": "A person who sees an event, typically a crime or accident, take place."},
        {"word": "withhold", "definition": "Refuse to give (something that is due to or is desired by another)."},
        {"word": "withstand", "definition": "Remain undamaged or unaffected by; resist."},
        {"word": "worship", "definition": "The feeling or expression of reverence and adoration for a deity."},
        {"word": "worthless", "definition": "Having no real value or use."},
        {"word": "wrathful", "definition": "Full of or characterized by intense anger."},
        {"word": "wretched", "definition": "In a very unhappy or unfortunate state."},
        {"word": "writhing", "definition": "Making twisting, squirming movements or contortions of the body."},
        {"word": "yield", "definition": "Produce or provide (a natural, agricultural, or industrial product)."},
        {"word": "zealous", "definition": "Having or showing zeal; passionate and enthusiastic."},
        {"word": "zenith", "definition": "The time at which something is most powerful or successful."},
        {"word": "zoology", "definition": "The scientific study of the behavior, structure, physiology, classification, and distribution of animals."}
      ]
    },
    {
      "week_id": 14,
      "words_data": [
        {"word": "aberration", "definition": "A departure from what is normal, usual, or expected, typically one that is unwelcome."},
        {"word": "abstinence", "definition": "The fact or practice of restraining oneself from indulging in something."},
        {"word": "accelerator", "definition": "A device, typically a foot pedal, which controls the speed of a vehicle's engine."},
        {"word": "accessory", "definition": "A thing which can be added to something else in order to make it more useful, versatile, or attractive."},
        {"word": "acclimatize", "definition": "Respond physiologically or behaviorally to a change in an environmental factor."},
        {"word": "accreditation", "definition": "The action or process of officially recognizing someone as having a particular status or being qualified to perform a particular activity."},
        {"word": "accumulate", "definition": "Gather together or acquire an increasing number or quantity of."},
        {"word": "accusation", "definition": "A charge or claim that someone has done something illegal or wrong."},
        {"word": "acoustics", "definition": "The properties or qualities of a room or building that determine how sound is transmitted in it."},
        {"word": "acquisition", "definition": "An asset or object bought or obtained, typically by a library or museum."},
        {"word": "activate", "definition": "Make (something) active or operative."},
        {"word": "acute", "definition": "Present or experienced to a severe or intense degree."},
        {"word": "adaptation", "definition": "The action or process of adapting or being adapted."},
        {"word": "adherent", "definition": "Someone who supports a particular party, person, or set of ideas."},
        {"word": "adjacent", "definition": "Next to or adjoining something else."},
        {"word": "adjustment", "definition": "A small alteration or movement made to achieve a desired fit, appearance, or result."},
        {"word": "administer", "definition": "Manage and be responsible for the running of (a business, organization, etc.)."},
        {"word": "admonish", "definition": "Warn or reprimand someone firmly."},
        {"word": "adversity", "definition": "Difficulties; misfortune."},
        {"word": "affiliate", "definition": "Officially attach or connect (a subsidiary group or a person) to an organization."},
        {"word": "affirm", "definition": "State as a fact; assert strongly and publicly."},
        {"word": "aggregate", "definition": "A whole formed by combining several separate elements."},
        {"word": "agitation", "definition": "A state of anxiety or nervous excitement."},
        {"word": "align", "definition": "Place or arrange (things) in a straight line."},
        {"word": "allegation", "definition": "A claim or assertion that someone has done something illegal or wrong, typically one made without proof."},
        {"word": "allocate", "definition": "Distribute (resources or duties) for a particular purpose."},
        {"word": "allude", "definition": "Suggest or call attention to indirectly; hint at."},
        {"word": "amalgamate", "definition": "Combine or unite to form one organization or structure."},
        {"word": "ambiguity", "definition": "The quality of being open to more than one interpretation; inexactness."},
        {"word": "amend", "definition": "Make minor changes in (a text) in order to make it fairer, more accurate, or more up-to-date."},
        {"word": "amplitude", "definition": "The maximum extent of a vibration or oscillation, measured from the position of equilibrium."},
        {"word": "analogy", "definition": "A comparison between two things, typically for the purpose of explanation or clarification."},
        {"word": "analytic", "definition": "Relating to or using analysis or logical reasoning."},
        {"word": "animate", "definition": "Bring to life."},
        {"word": "annihilate", "definition": "Destroy utterly; obliterate."},
        {"word": "annotate", "definition": "Add notes to (a text or diagram) giving explanation or comment."},
        {"word": "anomaly", "definition": "Something that deviates from what is standard, normal, or expected."},
        {"word": "antagonist", "definition": "A person who actively opposes or is hostile to someone or something; an adversary."},
        {"word": "antecedent", "definition": "A thing or event that existed before or logically precedes another."},
        {"word": "anthology", "definition": "A published collection of poems or other pieces of writing."}
      ]
    },
    {
      "week_id": 15,
      "words_data": [
        {"word": "antidote", "definition": "A medicine taken or given to counteract a particular poison."},
        {"word": "antiquity", "definition": "The ancient past, especially the period before the Middle Ages."},
        {"word": "antonym", "definition": "A word opposite in meaning to another (e.g., bad and good)."},
        {"word": "apathy", "definition": "Lack of interest, enthusiasm, or concern."},
        {"word": "aperture", "definition": "An opening, hole, or gap, especially a variable one which controls, the amount of light admitted to an optical instrument."},
        {"word": "apex", "definition": "The top or highest part of something, especially one forming a point."},
        {"word": "appall", "definition": "Greatly dismay or horrify."},
        {"word": "apparel", "definition": "Clothing."},
        {"word": "append", "definition": "Add (something) as an attachment or supplement."},
        {"word": "apprehension", "definition": "Anxiety or fear that something bad or unpleasant will happen."},
        {"word": "appropriate", "definition": "Suitable or proper in the circumstances."},
        {"word": "approximate", "definition": "Close to the actual, but not completely accurate or exact."},
        {"word": "arbiter", "definition": "A person who settles a dispute or has ultimate authority in a matter."},
        {"word": "arbitrary", "definition": "Based on random choice or personal whim, rather than any reason or system."},
        {"word": "archaic", "definition": "Very old or old-fashioned."},
        {"word": "articulate", "definition": "Having or showing the ability to speak fluently and coherently."},
        {"word": "ascertain", "definition": "Find (something) out for certain; make sure of."},
        {"word": "aspersion", "definition": "An attack on the reputation or integrity of someone or something."},
        {"word": "aspire", "definition": "Direct one's hopes or ambitions toward achieving something."},
        {"word": "assault", "definition": "Make a physical attack on."},
        {"word": "assemble", "definition": "Gather together in one place for a common purpose."},
        {"word": "assert", "definition": "State a fact or belief confidently and forcefully."},
        {"word": "assess", "definition": "Evaluate or estimate the nature, ability, or quality of."},
        {"word": "asset", "definition": "A useful or valuable thing, person, or quality."},
        {"word": "assimilate", "definition": "Take in (information, ideas, or culture) and understand fully."},
        {"word": "assuage", "definition": "Make (an unpleasant feeling) less intense."},
        {"word": "astute", "definition": "Having or showing an ability to accurately assess situations or people and turn this to one's advantage."},
        {"word": "asylum", "definition": "The protection granted by a nation to someone who has left their native country as a political refugee."},
        {"word": "atone", "definition": "Make amends or reparation."},
        {"word": "atrophy", "definition": "Waste away, typically due to the degeneration of cells."},
        {"word": "attain", "definition": "Succeed in achieving (something that one desires and has worked for)."},
        {"word": "attribute", "definition": "A quality or feature regarded as a characteristic or inherent part of someone or something."},
        {"word": "audacious", "definition": "Showing a willingness to take surprisingly bold risks."},
        {"word": "augment", "definition": "Make (something) greater by adding to it; increase."},
        {"word": "auspicious", "definition": "Conducive to success; favorable."},
        {"word": "authentic", "definition": "Of undisputed origin; genuine."},
        {"word": "authority", "definition": "The power or right to give orders, make decisions, and enforce obedience."},
        {"word": "automate", "definition": "Convert (a process or facility) to largely automatic operation."},
        {"word": "autonomous", "definition": "Having the freedom to act independently."},
        {"word": "aversion", "definition": "A strong dislike or disinclination."}
      ]
    }
  ]
}